( function ( $ ) {
	'use strict';

	var hocLatnSemicolon = {
		id: 'hoc-latn-semicolon',
		name: 'Ho Latin semicolon',
		description: 'Ho Latin semicolon keyboard',
		date: '2026-07-31',
		URL: 'https://www.mediawiki.org/wiki/Special:MyLanguage/Help:Extension:UniversalLanguageSelector/Input_methods/hoc-latn-semicolon',
		author: 'Mangu Purty',
		license: 'GPLv3',
		version: '1.0',
		maxKeyLength: 3,
		patterns: [



      //Uppercase
      //Consonants

		[ 'K;', 'Ḱ' ],
		[ 'C;', 'Ć' ],
		[ 'Z;', 'T́' ],
		[ '(W|P);', 'Ṕ' ],

		[ 'Ḱ;', 'K' ],
		[ 'Ć;', 'C' ],
		[ 'T́;', 'T' ],
		[ 'Ṕ;', 'P' ],
		
		[ 'T;', 'Ṭ' ],
		[ 'D;', 'Ḍ' ],
		[ 'R;', 'Ṛ' ],
			
		[ 'T\.\.', 'Ṭ' ],
		[ 'D\.\.', 'Ḍ' ],
		[ 'R\.\.', 'Ṛ' ],

		[ 'Ṭ;', 'T' ],
		[ 'Ḍ;', 'D' ],
		[ 'Ṛ;', 'R' ],
		
		[ 'N;', 'Ṅ' ],
		[ 'J;', 'Ń' ],

		[ 'Ṅ;', 'N' ],
		[ 'Ń;', 'J' ],

      //Vowels

		[ 'A;', 'Á' ],
		[ 'Á;', 'Ã' ],
		[ 'Ã;', 'Ä' ],
		[ 'Ä;', 'À' ],
		[ 'À;', 'Â' ],
		[ 'Â;', 'A' ],

		[ 'A`', 'À' ],
		[ 'A~', 'Ã' ],
		[ 'A\.\.', 'Ạ' ],
		[ 'Ạ\.\.', 'Ä' ],
		[ 'A^', 'Â' ],
		[ 'À`', 'Á' ],

		[ 'E;', 'É' ],
		[ 'É;', 'Ẽ' ],
		[ 'Ẽ;', 'Ë' ],
		[ 'Ë;', 'È' ],
		[ 'È;', 'Ê' ],
		[ 'Ê;', 'E' ],

		[ 'E`', 'È' ],
		[ 'E~', 'Ẽ' ],
		[ 'E\.\.', 'Ẹ' ],
		[ 'Ẹ\.\.', 'Ë' ],
		[ 'E^', 'Ê' ],
		[ 'È`', 'É' ],

		[ 'I;', 'Í' ],
		[ 'Í;', 'Ĩ' ],
		[ 'Ĩ;', 'Ï' ],
		[ 'Ï;', 'Ì' ],
		[ 'Ì;', 'Î' ],
		[ 'Î;', 'I' ],

		[ 'I`', 'Ì' ],
		[ 'I~', 'Ĩ' ],
		[ 'I\.\.', 'Ï' ],
		[ 'I^', 'Î' ],
		[ 'Ì`', 'Í' ],

		[ 'O;', 'Ó' ],
		[ 'Ó;', 'Õ' ],
		[ 'Õ;', 'Ö' ],
		[ 'Ö;', 'Ò' ],
		[ 'Ò;', 'Ô' ],
		[ 'Ô;', 'O' ],

		[ 'O`', 'Ò' ],
		[ 'O~', 'Õ' ],
		[ 'O\.\.', 'Ọ' ],
		[ 'Ọ\.\.', 'Ö' ],
		[ 'O^', 'Ô' ],
		[ 'Ò`', 'Ó' ],

		[ 'U;', 'Ú' ],
		[ 'Ú;', 'Ũ' ],
		[ 'Ũ;', 'Ü' ],
		[ 'Ü;', 'Ù' ],
		[ 'Ù;', 'Û' ],
		[ 'Û;', 'U' ],

		[ 'U`', 'Ù' ],
		[ 'U~', 'Ũ' ],
		[ 'U\.\.', 'Ü' ],
		[ 'U^', 'Û' ],
		[ 'Ù`', 'Ú' ],

		[ '\.;', '·' ],
		[ '\<;', '‹' ],
		[ '\>;', '›' ],
		[ '‹‹;', '«' ],
		[ '››;', '»' ],
		[ '\\\\~', '~' ],
		[ '\\\\\.', '.' ],
		[ '\\\\^', '^' ],
		[ '\\\\`', '`' ],
		[ '\\\\‹', '<' ],
		[ '\\\\‹', '>' ],

		[ '\;', ';' ]
		]
	};

	$.ime.register( hocLatnSemicolon );
}( jQuery ) );
