( function ( $ ) {
	'use strict';

	var hocLatnSemicolon = {
		id: 'hoc-latn-semicolon',
		name: 'Ho Latin semicolon',
		description: 'Ho Latin semicolon keyboard',
		date: '2026-07-31',
		URL: 'https://www.mediawiki.org/wiki/Special:MyLanguage/Help:Extension:UniversalLanguageSelector/Input_methods/hoc-latn-semicolon',
		author: 'Mangu Purty',
		license: 'GPLv3',
		version: '1.0',
		maxKeyLength: 3,
		patterns: [


		//uppercase

		[ 'Z;', 'T́' ],
		[ 'K;', 'Ḱ' ],
		[ 'C;', 'Ć' ],
		[ 'P;', 'Ṕ' ],
		[ 'W;', 'Ṕ' ],

//		[ 'Ḱ;', 'K' ], //works
//		[ 'Ć;', 'C' ], //works
//		[ 'T́;', 'Z' ], //causes issues
//		[ 'Ṕ;', 'P' ], //works
		
		[ 'T;', 'Ṭ' ],
		[ 'D;', 'Ḍ' ],
		[ 'R;', 'Ṛ' ],
//		[ 'T..', 'Ṭ' ], //messes up Z; > T́, outcome: Z; P; > ṬṔ, for some reason
//		[ 'D..', 'Ḍ' ], //works, disabled for consistency with T.. > Ṭ
//		[ 'R..', 'Ṛ' ], //works, disabled for consistency with T.. > Ṭ

//		[ 'Ṭ;', 'T' ], //causes issues
//		[ 'Ḍ;', 'D' ], //works
//		[ 'Ṛ;', 'R' ], //works
		
		[ 'N;', 'Ṅ' ],
		[ 'J;', 'Ń' ],

//		[ 'Ṅ;', 'N' ],
//		[ 'Ń;', 'J' ],

		[ 'A;', 'Á' ],
		[ 'Á;', 'Ã' ],
		[ 'Ã;', 'Ä' ],
		[ 'Ä;', 'À' ],
		[ 'À;', 'Â' ],
//		[ 'Â;', 'A' ], //causes issues

		[ 'A\u0060', 'À' ], //\u0060 = `
		[ 'A\u007E', 'Ã' ], //\u007E = ~
		[ 'A\u002E\u002E', 'Ạ' ], //\u002E = .
//		[ 'Ạ\.\.', 'Ä' ], //messes up the rest
		[ 'A\\^', 'Â' ], //\u005E = ^
		[ 'À\u0060', 'Á' ],

		[ 'E;', 'É' ],
		[ 'É;', 'Ẽ' ],
		[ 'Ẽ;', 'Ë' ],
		[ 'Ë;', 'È' ],
		[ 'È;', 'Ê' ],
//		[ 'Ê;', 'E' ], //causes issues

		[ 'E\u0060', 'È' ],
		[ 'E\u007E', 'Ẽ' ],
		[ 'E\u002E\u002E', 'Ẹ' ],
		[ 'E\\^', 'Ê' ],
		[ 'È\u0060', 'É' ],

		[ 'I;', 'Í' ],
		[ 'Í;', 'Ĩ' ],
		[ 'Ĩ;', 'Ï' ],
		[ 'Ï;', 'Ì' ],
		[ 'Ì;', 'Î' ],
//		[ 'Î;', 'I' ], //causes issues

		[ 'I\u0060', 'Ì' ],
		[ 'I\u007E', 'Ĩ' ],
		[ 'I\u002E\u002E', 'Ï' ],
		[ 'I\\^', 'Î' ],
		[ 'Ì\u0060', 'Í' ],

		[ 'O;', 'Ó' ],
		[ 'Ó;', 'Õ' ],
		[ 'Õ;', 'Ö' ],
		[ 'Ö;', 'Ò' ],
		[ 'Ò;', 'Ô' ],
//		[ 'Ô;', 'O' ], 

		[ 'O\u0060', 'Ò' ],
		[ 'O\u007E', 'Õ' ],
		[ 'O\u002E\u002E', 'Ọ' ],
//		[ 'Ọ\.\.', 'Ö' ],
		[ 'O\\^', 'Ô' ],
		[ 'Ò\u0060', 'Ó' ],

		[ 'U;', 'Ú' ],
		[ 'Ú;', 'Ũ' ],
		[ 'Ũ;', 'Ü' ],
		[ 'Ü;', 'Ù' ],
		[ 'Ù;', 'Û' ],
//		[ 'Û;', 'U' ], //causes issues

		[ 'U\u0060', 'Ù' ],
		[ 'U\u007E', 'Ũ' ],
		[ 'U\u002E\u002E', 'Ü' ],
		[ 'U\\^', 'Û' ],
		[ 'Ù\u0060', 'Ú' ],

		//lowercase

		[ 'z;', 't́' ],
		[ 'k;', 'ḱ' ],
		[ 'c;', 'ć' ],
		[ 'p;', 'ṕ' ],
		[ 'w;', 'ṕ' ],

//		[ 'ḱ;', 'k' ], //works
//		[ 'ć;', 'c' ], //works
//		[ 't́;', 'z' ], //causes issues
//		[ 'ṕ;', 'p' ], //works
		
		[ 't;', 'ṭ' ],
		[ 'd;', 'ḍ' ],
		[ 'r;', 'ṛ' ],
//		[ 't..', 'ṭ' ], //messes up z; > t́, outcome: z; p; > ṭṕ, for some reason
//		[ 'd..', 'ḍ' ], //works, disabled for consistency with t.. > ṭ
//		[ 'r..', 'ṛ' ], //works, disabled for consistency with t.. > ṭ

//		[ 'ṭ;', 't' ], //causes issues
//		[ 'ḍ;', 'd' ], //works
//		[ 'ṛ;', 'r' ], //works
		
		[ 'n;', 'ṅ' ],
		[ 'j;', 'ń' ],

//		[ 'ṅ;', 'n' ],
//		[ 'ń;', 'j' ],

		[ 'a;', 'á' ],
		[ 'á;', 'ã' ],
		[ 'ã;', 'ä' ],
		[ 'ä;', 'à' ],
		[ 'à;', 'â' ],
//		[ 'â;', 'a' ], //causes issues

		[ 'a\u0060', 'à' ], //\u0060 = `
		[ 'a\u007e', 'ã' ], //\u007e = ~
		[ 'a\u002e\u002e', 'ạ' ], //\u002e = .
//		[ 'ạ\.\.', 'ä' ], //messes up the rest
		[ 'a\\^', 'â' ], //\u005e = ^
		[ 'à\u0060', 'á' ],

		[ 'e;', 'é' ],
		[ 'é;', 'ẽ' ],
		[ 'ẽ;', 'ë' ],
		[ 'ë;', 'è' ],
		[ 'è;', 'ê' ],
//		[ 'ê;', 'e' ], //causes issues

		[ 'e\u0060', 'è' ],
		[ 'e\u007e', 'ẽ' ],
		[ 'e\u002e\u002e', 'ẹ' ],
		[ 'e\\^', 'ê' ],
		[ 'è\u0060', 'é' ],

		[ 'i;', 'í' ],
		[ 'í;', 'ĩ' ],
		[ 'ĩ;', 'ï' ],
		[ 'ï;', 'ì' ],
		[ 'ì;', 'î' ],
//		[ 'î;', 'i' ], //causes issues

		[ 'i\u0060', 'ì' ],
		[ 'i\u007e', 'ĩ' ],
		[ 'i\u002e\u002e', 'ï' ],
		[ 'i\\^', 'î' ],
		[ 'ì\u0060', 'í' ],

		[ 'o;', 'ó' ],
		[ 'ó;', 'õ' ],
		[ 'õ;', 'ö' ],
		[ 'ö;', 'ò' ],
		[ 'ò;', 'ô' ],
//		[ 'ô;', 'o' ], 

		[ 'o\u0060', 'ò' ],
		[ 'o\u007e', 'õ' ],
		[ 'o\u002e\u002e', 'ọ' ],
//		[ 'ọ\.\.', 'ö' ],
		[ 'o\\^', 'ô' ],
		[ 'ò\u0060', 'ó' ],

		[ 'u;', 'ú' ],
		[ 'ú;', 'ũ' ],
		[ 'ũ;', 'ü' ],
		[ 'ü;', 'ù' ],
		[ 'ù;', 'û' ],
//		[ 'û;', 'u' ], //causes issues

		[ 'u\u0060', 'ù' ],
		[ 'u\u007e', 'ũ' ],
		[ 'u\u002e\u002e', 'ü' ],
		[ 'u\\^', 'û' ],
		[ 'ù\u0060', 'ú' ],

		//punctuation
		[ '\u003C', '‹' ], //\u003C = <
		[ '\u003E', '›' ],//\u003E = >
		[ '››', '»' ],
		[ '‹‹', '«' ],

		[ '\\\\;', ';' ],

//		[ '\\\\\u007E', '\u007E' ], //\u007E = ~, \\\\ = \
//		[ '\\\\\u0060', '\u0060' ], //\u0060 = `
		[ '\\\\\\^', '\\^' ],
		[ '\\\\‹', '\u003C' ], //\u003C = <
		[ '\\\\›', '\u003E' ], //\u003E = >

		[ '\u002E;', '·' ]
		]
	};

	$.ime.register( hocLatnSemicolon );
}( jQuery ) );
