(function ($) {
	'use strict';
	const consonant_a = '[ᬓᬔᬕᬖᬗᬘᬙᬚᬛᬜᬝᬞᬟᬠᬡᬢᬣᬤᬥᬦᬧᬨᬩᬪᬫᬬᬭᬮᬯᬲᬰᬱᬳᭈᭉᭊᭆᭋ]';
	const all_aksara = '[ᬅᬇᬑᬏᬉᬐᬈᬋᬍᬎᬓᬔᬕᬖᬗᬘᬙᬚᬛᬜᬝᬞᬟᬠᬡᬢᬣᬤᬥᬦᬧᬨᬩᬪᬫᬬᭈᭉᭊᭆᭋᬭᬮᬯᬲᬰᬱᬳᬵꦵᬀᬶᬷᬸᬹᬾᬿᭂ᬴]';
	const symbol = '[᭛᭾᭚᭽᭟᭞‍ ]';
	const non_3_stack = '[ᬓᬔᬕᬖᬗᬘᬙᬚᬛᬜᬝᬞᬟᬠᬡᬢᬣᬤᬥᬦᬩᬪᬫᬮᬯᬰ]';


	var banmanuscript = {
		id: 'ban-manuscript',
		name: 'Balinese',
		description: 'Balinese Manuscript',
		date: '2026-06-15',
		URL: '',
		author: 'Gesha Mahendra',
		license: 'GPLv3',
		version: '1',
		contextLength: 10,
		maxKeyLength: 10,

		patterns: [
			// Escape backslash (dari ULS asli, tetap dipertahankan)
			['\\\\([A-Za-z\\>_~\\.0-9])', '\\\\', '$1'],

			// sigeg
			['(' + all_aksara + ')ᬗ᭄ ', '$1ᬂ'],
			['(' + all_aksara + ')ᬳ᭄ ', '$1ᬄ'],
			['(' + all_aksara + ')ᬭ᭄ ', '$1ᬃ'],

			// sigeg fixup
			['ᬃᬡ᭄ᬦ᭄y', 'ᬃᬦ᭄ᬬ᭄'],
			['ᬳ᭄ᬦ᭄y', 'ᬄᬦ᭄ᬬ᭄'],
			['ᬗ᭄ᬦ᭄y', 'ᬂᬦ᭄ᬬ᭄'],

			// sigeg swara
			['ᬗ᭄A', 'ᬂᬅ'],
			['ᬗ᭄I', 'ᬂᬇ'],
			['ᬗ᭄U', 'ᬂᬉ'],
			['ᬗ᭄O', 'ᬂᬑ'],
			['ᬗ᭄E', 'ᬂᬏ'],
			['ᬗ᭄Q', 'ᬂᬅᭂ'],

			['ᬳ᭄A', 'ᬄᬅ'],
			['ᬳ᭄I', 'ᬄᬇ'],
			['ᬳ᭄U', 'ᬄᬉ'],
			['ᬳ᭄O', 'ᬄᬑ'],
			['ᬳ᭄E', 'ᬄᬏ'],
			['ᬳ᭄Q', 'ᬄᬅᭂ'],

			['ᬭ᭄A', 'ᬃᬅ'],
			['ᬭ᭄I', 'ᬃᬇ'],
			['ᬭ᭄U', 'ᬃᬉ'],
			['ᬭ᭄O', 'ᬃᬑ'],
			['ᬭ᭄E', 'ᬃᬏ'],
			['ᬭ᭄Q', 'ᬃᬅᭂ'],

			// sigeg symbol case
			['ᬗ᭄!', 'ᬂ᭛'],
			['ᬗ᭄@', 'ᬂ᭾'],
			['ᬗ᭄#', 'ᬂ᭚'],
			['ᬗ᭄\\$', 'ᬂ᭽'],
			['ᬗ᭄[:;]', 'ᬂ᭝'],
			['ᬗ᭄1', 'ᬂ᭝᭑'],
			['ᬗ᭄2', 'ᬂ᭝᭒'],
			['ᬗ᭄3', 'ᬂ᭝᭓'],
			['ᬗ᭄4', 'ᬂ᭝᭔'],
			['ᬗ᭄5', 'ᬂ᭝᭕'],
			['ᬗ᭄6', 'ᬂ᭝᭖'],
			['ᬗ᭄7', 'ᬂ᭝᭗'],
			['ᬗ᭄8', 'ᬂ᭝᭘'],
			['ᬗ᭄9', 'ᬂ᭝᭙'],
			['ᬗ᭄0', 'ᬂ᭝᭐'],

			['ᬗ᭄,', 'ᬂ᭞'],
			['ᬗ᭄\\.', 'ᬂ᭟'],
			['ᬗ᭄\\?', 'ᬂ? '],

			['ᬳ᭄!', 'ᬄ᭛'],
			['ᬳ᭄@', 'ᬄ᭾'],
			['ᬳ᭄#', 'ᬄ᭚'],
			['ᬳ᭄\\$', 'ᬄ᭽'],
			['ᬳ᭄[:;]', 'ᬄ᭝'],
			['ᬳ᭄1', 'ᬄ᭝᭑'],
			['ᬳ᭄2', 'ᬄ᭝᭒'],
			['ᬳ᭄3', 'ᬄ᭝᭓'],
			['ᬳ᭄4', 'ᬄ᭝᭔'],
			['ᬳ᭄5', 'ᬄ᭝᭕'],
			['ᬳ᭄6', 'ᬄ᭝᭖'],
			['ᬳ᭄7', 'ᬄ᭝᭗'],
			['ᬳ᭄8', 'ᬄ᭝᭘'],
			['ᬳ᭄9', 'ᬄ᭝᭙'],
			['ᬳ᭄0', 'ᬄ᭝᭐'],

			['ᬳ᭄,', 'ᬄ᭞'],
			['ᬳ᭄\\.', 'ᬄ᭟'],
			['ᬳ᭄\\?', 'ᬄ? '],

			['(' + consonant_a + ')ᬃ!', '$1ᬭ᭄᭛'],
			['(' + consonant_a + ')ᬃ@', '$1ᬭ᭄᭾'],
			['(' + consonant_a + ')ᬃ#', '$1ᬭ᭄᭚'],
			['(' + consonant_a + ')ᬃ\\$', '$1ᬭ᭄᭽'],
			['(' + consonant_a + ')ᬃ[:;]', '$1ᬭ᭄᭝'],
			['(' + consonant_a + ')ᬃ1', '$1ᬭ᭄᭝᭑'],
			['(' + consonant_a + ')ᬃ2', '$1ᬭ᭄᭝᭒'],
			['(' + consonant_a + ')ᬃ3', '$1ᬭ᭄᭝᭓'],
			['(' + consonant_a + ')ᬃ4', '$1ᬭ᭄᭝᭔'],
			['(' + consonant_a + ')ᬃ5', '$1ᬭ᭄᭝᭕'],
			['(' + consonant_a + ')ᬃ6', '$1ᬭ᭄᭝᭖'],
			['(' + consonant_a + ')ᬃ7', '$1ᬭ᭄᭝᭗'],
			['(' + consonant_a + ')ᬃ8', '$1ᬭ᭄᭝᭘'],
			['(' + consonant_a + ')ᬃ9', '$1ᬭ᭄᭝᭙'],
			['(' + consonant_a + ')ᬃ0', '$1ᬭ᭄᭝᭐'],

			['(' + consonant_a + ')ᬃ,', '$1ᬭ᭄᭞'],
			['(' + consonant_a + ')ᬃ\\.', '$1ᬭ᭄᭟'],
			['(' + consonant_a + ')ᬃ\\?', '$1ᬭ᭄? '],

			// null shortcut
			['^', 'a', '$1ᬳ'],
			['^', 'i', '$1ᬳᬶ'],
			['^', 'u', '$1ᬳᬸ'],
			['^', 'q', '$1ᬳᭂ'],
			['^', 'e', '$1ᬳᬾ'],
			['^', 'o', '$1ᬳᭀ'],

			// symbol shortcut
			['(' + symbol + ')a', '$1ᬳ'],
			['(' + symbol + ')i', '$1ᬳᬶ'],
			['(' + symbol + ')u', '$1ᬳᬸ'],
			['(' + symbol + ')q', '$1ᬳᭂ'],
			['(' + symbol + ')e', '$1ᬳᬾ'],
			['(' + symbol + ')o', '$1ᬳᭀ'],

			// zwsp vowel shotrcut
			['(' + consonant_a + ')᭄\u25CCa', '$1᭄ᬳ'],
			['(' + consonant_a + ')᭄\u25CCi', '$1᭄ᬳᬶ'],
			['(' + consonant_a + ')᭄\u25CCu', '$1᭄ᬳᬸ'],
			['(' + consonant_a + ')᭄\u25CCq', '$1᭄ᬳᭂ'],
			['(' + consonant_a + ')᭄\u25CCe', '$1᭄ᬳᬾ'],
			['(' + consonant_a + ')᭄\u25CCo', '$1᭄ᬳᭀ'],

			['(' + consonant_a + ')᭄\u25CCA', '$1᭄\u200Bᬅ'],
			['(' + consonant_a + ')᭄\u25CCI', '$1᭄\u200Bᬇ'],
			['(' + consonant_a + ')᭄\u25CCU', '$1᭄\u200Bᬉ'],
			['(' + consonant_a + ')᭄\u25CCQ', '$1᭄\u200Bᬅᭂ'],
			['(' + consonant_a + ')᭄\u25CCE', '$1᭄\u200Bᬏ'],
			['(' + consonant_a + ')᭄\u25CCO', '$1᭄\u200Bᬑ'],

			// force swara always above
			['(' + consonant_a + ')᭄A', '$1᭄\u200Bᬅ'],
			['(' + consonant_a + ')᭄I', '$1᭄\u200Bᬇ'],
			['(' + consonant_a + ')᭄U', '$1᭄\u200Bᬉ'],
			['(' + consonant_a + ')᭄Q', '$1᭄\u200Bᬅᭂ'],
			['(' + consonant_a + ')᭄E', '$1᭄\u200Bᬏ'],
			['(' + consonant_a + ')᭄O', '$1᭄\u200Bᬑ'],

			// la pepet & pa cerek variant
			['(' + consonant_a + ')᭄ᬮ᭄q', '$1᭄ᬮᭂ'],
			['(' + consonant_a + ')᭄ᬮᭂ ', '$1᭄\u200Bᬍ'],

			['(' + consonant_a + ')᭄\u25CCᬭ᭄q', '$1᭄ᬋ'],
			['(' + consonant_a + ')᭄ᬭ᭄q', '$1ᬺ'],

			['ᬮ᭄q', 'ᬍ'],
			['ᬭ᭄q', 'ᬋ'],

			// swara elongation
			['ᬅ[aA]', 'ᬆ'],
			['ᬇ[iIa]', 'ᬈ'],
			['ᬉ[uU]', 'ᬊ'],
			['ᬅᭂ[qQ]', 'ᬅᭃ'],
			['ᬏ[eE]', 'ᬐ'],
			['ᬑ[oO]', 'ᬒ'],

			// special swara
			['ᬋ[aiueqo]', 'ᬋ'],
			['ᬍ[aiueqo]', 'ᬍ'],
			['ᬺ[aiueqo]', 'ᬺ'],

			// return sandhangan
			['(' + consonant_a + ')᭄a', '$1'],
			['(' + consonant_a + ')᭄i', '$1ᬶ'],
			['(' + consonant_a + ')᭄u', '$1ᬸ'],
			['(' + consonant_a + ')᭄e', '$1ᬾ'],
			['(' + consonant_a + ')᭄q', '$1ᭂ'],
			['(' + consonant_a + ')᭄o', '$1ᭀ'],

			['(' + consonant_a + ')᭄\\)', '$1᬴'],
			['(' + consonant_a + ')᭄M', '$1ᬁ'],
			['(' + consonant_a + ')᭄ ', '$1᭄\u25CC'],

			// special cecak telu
			['(' + consonant_a + ')᬴᭄a', '$1᬴'],
			['(' + consonant_a + ')᬴᭄i', '$1᬴ᬶ'],
			['(' + consonant_a + ')᬴᭄u', '$1᬴ᬸ'],
			['(' + consonant_a + ')᬴᭄e', '$1᬴ᬾ'],
			['(' + consonant_a + ')᬴᭄q', '$1᬴ᭂ'],
			['(' + consonant_a + ')᬴᭄o', '$1᬴ᭀ'],

			['(' + consonant_a + ')᬴i', '$1᬴ᬿ'],
			['(' + consonant_a + ')᬴u', '$1᬴ᭁ'],

			// sandhangan fixup 
			['(' + consonant_a + ')i', '$1ᬿ'],
			['(' + consonant_a + ')u', '$1ᭁ'],

			['(' + consonant_a + ')q', '$1ᬳᭂ'],
			['(' + consonant_a + ')e', '$1ᬳᬾ'],
			['(' + consonant_a + ')o', '$1ᬳᭀ'],

			// sigeg-vocal fixup 

			['(ᬃ)A', '$1ᬳ'],
			['(ᬃ)i', '$1ᬳᬶ'],
			['(ᬃ)u', '$1ᬳᬸ'],
			['(ᬃ)q', '$1ᬳᭂ'],
			['(ᬃ)e', '$1ᬳᬾ'],
			['(ᬃ)o', '$1ᬳᭀ'],

			['(ᬂ)a', '$1ᬳ'],
			['(ᬂ)i', '$1ᬳᬶ'],
			['(ᬂ)u', '$1ᬳᬸ'],
			['(ᬂ)q', '$1ᬳᭂ'],
			['(ᬂ)e', '$1ᬳᬾ'],
			['(ᬂ)o', '$1ᬳᭀ'],

			['(ᬄ)a', '$1ᬳ'],
			['(ᬄ)i', '$1ᬳᬶ'],
			['(ᬄ)u', '$1ᬳᬸ'],
			['(ᬄ)q', '$1ᬳᭂ'],
			['(ᬄ)e', '$1ᬳᬾ'],
			['(ᬄ)o', '$1ᬳᭀ'],

			// swara-vocal fixup 

			['(ᬅ)i', '$1ᬳᬶ'],
			['(ᬅ)u', '$1ᬳᬸ'],
			['(ᬅ)q', '$1ᬳᭂ'],
			['(ᬅ)e', '$1ᬳᬾ'],
			['(ᬅ)o', '$1ᬳᭀ'],

			['(ᬆ)i', '$1ᬳᬶ'],
			['(ᬆ)u', '$1ᬳᬸ'],
			['(ᬆ)q', '$1ᬳᭂ'],
			['(ᬆ)e', '$1ᬳᬾ'],
			['(ᬆ)o', '$1ᬳᭀ'],

			['(ᬇ)u', '$1ᬳᬸ'],
			['(ᬇ)q', '$1ᬳᭂ'],
			['(ᬇ)e', '$1ᬳᬾ'],
			['(ᬇ)o', '$1ᬳᭀ'],

			['(ᬈ)a', '$1ᬳ'],
			['(ᬈ)u', '$1ᬳᬸ'],
			['(ᬈ)q', '$1ᬳᭂ'],
			['(ᬈ)e', '$1ᬳᬾ'],
			['(ᬈ)o', '$1ᬳᭀ'],

			['(ᬉ)a', '$1ᬳ'],
			['(ᬉ)i', '$1ᬳᬶ'],
			['(ᬉ)q', '$1ᬳᭂ'],
			['(ᬉ)e', '$1ᬳᬾ'],
			['(ᬉ)o', '$1ᬳᭀ'],

			['(ᬊ)a', '$1ᬳ'],
			['(ᬊ)i', '$1ᬳᬶ'],
			['(ᬊ)q', '$1ᬳᭂ'],
			['(ᬊ)e', '$1ᬳᬾ'],
			['(ᬊ)o', '$1ᬳᭀ'],

			['(ᬏ)a', '$1ᬳ'],
			['(ᬏ)i', '$1ᬳᬶ'],
			['(ᬏ)u', '$1ᬳᬸ'],
			['(ᬏ)q', '$1ᬳᭂ'],
			['(ᬏ)o', '$1ᬳᭀ'],

			['(ᬐ)a', '$1ᬳ'],
			['(ᬐ)i', '$1ᬳᬶ'],
			['(ᬐ)u', '$1ᬳᬸ'],
			['(ᬐ)q', '$1ᬳᭂ'],
			['(ᬐ)e', '$1ᬳᬾ'],
			['(ᬐ)o', '$1ᬳᭀ'],

			['(ᬅᭂ)a', '$1ᬳ'],
			['(ᬅᭂ)i', '$1ᬳᬶ'],
			['(ᬅᭂ)u', '$1ᬳᬸ'],
			['(ᬅᭂ)e', '$1ᬳᬾ'],
			['(ᬅᭂ)o', '$1ᬳᭀ'],

			['(ᬅᭃ)a', '$1ᬳ'],
			['(ᬅᭃ)i', '$1ᬳᬶ'],
			['(ᬅᭃ)u', '$1ᬳᬸ'],
			['(ᬅᭃ)e', '$1ᬳᬾ'],
			['(ᬅᭃ)o', '$1ᬳᭀ'],

			['(ᬑ)a', '$1ᬳ'],
			['(ᬑ)i', '$1ᬳᬶ'],
			['(ᬑ)q', '$1ᬳᭂ'],
			['(ᬑ)e', '$1ᬳᬾ'],

			['(ᬒ)a', '$1ᬳ'],
			['(ᬒ)i', '$1ᬳᬶ'],
			['(ᬒ)u', '$1ᬳᬸ'],
			['(ᬒ)q', '$1ᬳᭂ'],
			['(ᬒ)e', '$1ᬳᬾ'],
			['(ᬒ)o', '$1ᬳᭀ'],

			// sandangan-vocal meetup
			['(' + consonant_a + ')ᬶq', '$1᭄ᬬᭂ'],
			['(' + consonant_a + ')ᬶe', '$1᭄ᬬᬾ'],
			['(' + consonant_a + ')ᬶo', '$1᭄ᬬᭀ'],

			['(' + consonant_a + ')ᬷq', '$1᭄ᬬᭂ'],
			['(' + consonant_a + ')ᬷe', '$1᭄ᬬᬾ'],
			['(' + consonant_a + ')ᬷo', '$1᭄ᬬᭀ'],

			['(' + consonant_a + ')ᬸq', '$1᭄ᬯᭂ'],
			['(' + consonant_a + ')ᬸe', '$1᭄ᬯᬾ'],
			['(' + consonant_a + ')ᬸo', '$1᭄ᬯᭀ'],

			['(' + consonant_a + ')ᬹq', '$1᭄ᬯᭂ'],
			['(' + consonant_a + ')ᬹe', '$1᭄ᬯᬾ'],
			['(' + consonant_a + ')ᬹo', '$1᭄ᬯᭀ'],

			['(ᬵ)i', '$1ᬳᬶ'],
			['(ᬵ)u', '$1ᬳᬸ'],
			['(ᬵ)q', '$1ᬳᭂ'],
			['(ᬵ)e', '$1ᬳᬾ'],
			['(ᬵ)o', '$1ᬳᭀ'],

			['(ᬾ)a', '$1ᬬ'],
			['(ᬾ)i', '$1ᬬᬶ'],
			['(ᬾ)u', '$1ᬬᬸ'],
			['(ᬾ)q', '$1ᬬᭂ'],
			['(ᬾ)o', '$1ᬬᭀ'],

			['(ᭂ)a', '$1ᬳ'],
			['(ᭂ)i', '$1ᬳᬶ'],
			['(ᭂ)u', '$1ᬳᬸ'],
			['(ᭂ)e', '$1ᬳᬾ'],
			['(ᭂ)o', '$1ᬳᭀ'],

			['(ᭃ)a', '$1ᬳ'],
			['(ᭃ)i', '$1ᬳᬶ'],
			['(ᭃ)u', '$1ᬳᬸ'],
			['(ᭃ)e', '$1ᬳᬾ'],
			['(ᭃ)o', '$1ᬳᭀ'],

			['(ᭀ)a', '$1ᬯ'],
			['(ᭀ)i', '$1ᬯᬶ'],
			['(ᭀ)u', '$1ᬯᬸ'],
			['(ᭀ)q', '$1ᬯᭂ'],
			['(ᭀ)e', '$1ᬯᬾ'],

			// change panglancar h
			['᭄ᬳ ', '᭄200Bᬅ'],
			['᭄ᬳᬵ ', '᭄200Bᬆ'],
			['᭄ᬳᬶ ', '᭄200Bᬇ'],
			['᭄ᬳᬷ ', '᭄200Bᬈ'],
			['᭄ᬳᬸ ', '᭄200Bᬉ'],
			['᭄ᬳᬹ ', '᭄200Bᬊ'],
			['᭄ᬳᭂ ', '᭄200Bᬅᭂ'],
			['᭄ᬳᭃ ', '᭄200Bᬅᭃ'],
			['᭄ᬳᬾ ', '᭄200Bᬏ'],
			['᭄ᬳᭀ ', '᭄200Bᬑ'],
			['᭄ᬳᬿ ', '᭄200Bᬐ'],
			['᭄ᬳᭁ ', '᭄200Bᬒ'],

			['ᬳ ', 'ᬅ'],
			['ᬳᬵ ', 'ᬆ'],
			['ᬳᬶ ', 'ᬇ'],
			['ᬳᬷ ', 'ᬈ'],
			['ᬳᬸ ', 'ᬉ'],
			['ᬳᬹ ', 'ᬊ'],
			['ᬳᭂ ', 'ᬅᭂ'],
			['ᬳᭃ ', 'ᬅᭃ'],
			['ᬳᬾ ', 'ᬏ'],
			['ᬳᭀ ', 'ᬑ'],
			['ᬳᬿ ', 'ᬐ'],
			['ᬳᭁ ', 'ᬒ'],

			// redo panglancar h
			['᭄200Bᬅ ', '᭄ᬳ'],
			['᭄200Bᬆ ', '᭄ᬳᬵ'],
			['᭄200Bᬇ ', '᭄ᬳᬶ'],
			['᭄200Bᬈ ', '᭄ᬳᬷ'],
			['᭄200Bᬉ ', '᭄ᬳᬸ'],
			['᭄200Bᬊ ', '᭄ᬳᬹ'],
			['᭄200Bᬅᭂ ', '᭄ᬳᭂ'],
			['᭄200Bᬅᭃ ', '᭄ᬳᭃ'],
			['᭄200Bᬏ ', '᭄ᬳᬾ'],
			['᭄200Bᬑ ', '᭄ᬳᭀ'],
			['᭄200Bᬐ ', '᭄ᬳᬿ'],
			['᭄200Bᬒ ', '᭄ᬳᭁ'],

			['ᬅ ', 'ᬳ'],
			['ᬆ ', 'ᬳᬵ'],
			['ᬇ ', 'ᬳᬶ'],
			['ᬈ ', 'ᬳᬷ'],
			['ᬉ ', 'ᬳᬸ'],
			['ᬊ ', 'ᬳᬹ'],
			['ᬅᭂ ', 'ᬳᭂ'],
			['ᬅᭃ ', 'ᬳᭃ'],
			['ᬏ ', 'ᬳᬾ'],
			['ᬑ ', 'ᬳᭀ'],
			['ᬐ ', 'ᬳᬿ'],
			['ᬒ ', 'ᬳᭁ'],

			// sandhangan modification
			['ᬵa', 'ᬵ'],

			['ᬶi', 'ᬷ'],
			['ᬷi', 'ᬷ'],

			['ᬸu', 'ᬹ'],
			['ᬹu', 'ᬹ'],

			['ᬾe', 'ᬿ'],
			['ᬿe', 'ᬿ'],

			['ᭀo', 'ᭁ'],
			['ᭁo', 'ᭁ'],

			['᬴\\)', '᬴'],
			['ᬁM', 'ᬁ'],

			['ᭂq', 'ᭃ'],
			['ᭃq', 'ᭃ'],

			['ᬶa', '᭄ᬬ'],
			['ᬶu', '᭄ᬬᬸ'],
			['ᬸa', '᭄ᬯ'],
			['ᬸi', '᭄ᬯᬶ'],

			// contextual dictionary
			['ᬦ᭄c', 'ᬜ᭄ᬘ᭄'],
			['ᬦ᭄C', 'ᬜ᭄ᬙ᭄'],
			['ᬦ᭄j', 'ᬜ᭄ᬚ᭄'],
			['ᬦ᭄J', 'ᬜ᭄ᬛ᭄'],
			['ᬦ᭄f', 'ᬡ᭄ᬝ᭄'],
			['ᬦ᭄F', 'ᬡ᭄ᬞ᭄'],
			['ᬦ᭄v', 'ᬡ᭄ᬟ᭄'],
			['ᬦ᭄V', 'ᬡ᭄ᬠ᭄'],

			['ᬡ᭄D', 'ᬦ᭄ᬥ᭄'],
			['ᬡ᭄ᬤ᭄h', 'ᬦ᭄ᬥ᭄'],

			['ᬲ᭄f', 'ᬱ᭄ᬝ᭄'],
			['ᬲ᭄F', 'ᬱ᭄ᬞ᭄'],

			['ᬓ᭄s', 'ᬓ᭄ᬱ᭄'],
			['ᬕ᭄s', 'ᬕ᭄ᬱ᭄'],

			['ᬓ᭄ᬲ᭄m', 'ᬓ᭄ᬱ᭄ᬫ᭄'],

			['ᬓ᭄\u25CCs', 'ᬓ᭄ᬲ᭄'],
			['ᬕ᭄\u25CCs', 'ᬕ᭄ᬲ᭄'],

			['ᬓᬺᬲ᭄n', 'ᬓᬺᬱ᭄ᬡ᭄'],

			['ᬯᬶᬲ᭄n', 'ᬯᬶᬱ᭄ᬡ᭄'],

			['ᬯᬶᬱ᭄ᬡ᭄ ', 'ᬯᬶᬲ᭄ᬦ᭄'],
			['ᬚ᭄ᬜ᭄ ', 'ᭌ᭄'],

			['ᬲ᭄c', 'ᬰ᭄ᬘ᭄'],
			['ᬲ᭄C', 'ᬰ᭄ᬙ᭄'],
			['ᬲ᭄j', 'ᬰ᭄ᬚ᭄'],
			['ᬲ᭄J', 'ᬰ᭄ᬛ᭄'],

			['ᬰ᭄ᬘ᭄ ', 'ᬲ᭄ᬘ᭄'],
			['ᬰ᭄ᬙ᭄ ', 'ᬲ᭄ᬙ᭄'],
			['ᬰ᭄ᬚ᭄ ', 'ᬲ᭄ᬚ᭄'],
			['ᬰ᭄ᬛ᭄ ', 'ᬲ᭄ᬛ᭄'],

			['ᬺᬲ᭄n', 'ᬺᬱ᭄ᬡ᭄'],
			['ᬺᬲ᭄t', 'ᬺᬱ᭄ᬝ᭄'],
			['ᬺᬤ᭄d', 'ᬺᬤ᭄ᬥ᭄'],

			['ᬧᬸᬲ᭄p', 'ᬧᬸᬱ᭄ᬧ᭄'],
			['ᬧᬸᬱ᭄ᬧ᭄u', 'ᬧᬸᬲ᭄ᬧᬸ'],

			// pasangan-\u25CC separation
			['(' + consonant_a + ')᭄\u25CC\\?', '$1᭄? '],
			['(' + consonant_a + ')᭄\u25CC/', '$1᭄᭝'],
			['(' + consonant_a + ')᭄\u25CCN', '$1᭄\u200Bᬡ᭄'],
			['(' + consonant_a + ')᭄\u25CCB', '$1᭄\u200Bᬪ᭄'],
			['(' + consonant_a + ')᭄\u25CCV', '$1᭄\u200Bᬠ᭄'],
			['(' + consonant_a + ')᭄\u25CCC', '$1᭄\u200Bᬙ᭄'],
			['(' + consonant_a + ')᭄\u25CCZ', '$1᭄\u200Bᬚ᭄ᬜ᭄'],
			['(' + consonant_a + ')᭄\u25CCL', '$1᭄\u200B᭄ᬮ᭄'],
			['(' + consonant_a + ')᭄\u25CCK', '$1᭄\u200Bᬔ᭄'],
			['(' + consonant_a + ')᭄\u25CCJ', '$1᭄\u200Bᬛ᭄'],
			['(' + consonant_a + ')᭄\u25CCH', '$1᭄\u200Bᬄ'],
			['(' + consonant_a + ')᭄\u25CCG', '$1᭄\u200Bᬖ᭄'],
			['(' + consonant_a + ')᭄\u25CCF', '$1᭄\u200Bᬞ᭄'],
			['(' + consonant_a + ')᭄\u25CCD', '$1᭄\u200Bᬥ᭄'],
			['(' + consonant_a + ')᭄\u25CCS', '$1᭄\u200Bᬱ᭄'],
			['(' + consonant_a + ')᭄\u25CCP', '$1᭄\u200Bᬨ᭄'],
			['(' + consonant_a + ')᭄\u25CCT', '$1᭄\u200Bᬣ᭄'],

			['(' + consonant_a + ')᭄\u25CCm', '$1᭄\u200Bᬫ᭄'],
			['(' + consonant_a + ')᭄\u25CCn', '$1᭄\u200Bᬦ᭄'],
			['(' + consonant_a + ')᭄\u25CCb', '$1᭄\u200Bᬩ᭄'],
			['(' + consonant_a + ')᭄\u25CCv', '$1᭄\u200Bᬟ᭄'],
			['(' + consonant_a + ')᭄\u25CCc', '$1᭄\u200Bᬘ᭄'],
			['(' + consonant_a + ')᭄\u25CCx', '$1᭄\u200Bᬗ᭄'],
			['(' + consonant_a + ')᭄\u25CCz', '$1᭄\u200Bᬜ᭄'],
			['(' + consonant_a + ')᭄\u25CCl', '$1᭄\u200Bᬮ᭄'],
			['(' + consonant_a + ')᭄\u25CCk', '$1᭄\u200Bᬓ᭄'],
			['(' + consonant_a + ')᭄\u25CCj', '$1᭄\u200Bᬚ᭄'],
			['(' + consonant_a + ')᭄\u25CCh', '$1᭄\u200Bᬳ᭄'],
			['(' + consonant_a + ')᭄\u25CCg', '$1᭄\u200Bᬕ᭄'],
			['(' + consonant_a + ')᭄\u25CCf', '$1᭄\u200Bᬝ᭄'],
			['(' + consonant_a + ')᭄\u25CCd', '$1᭄\u200Bᬤ᭄'],
			['(' + consonant_a + ')᭄\u25CCs', '$1᭄\u200Bᬲ᭄'],
			['(' + consonant_a + ')᭄\u25CCp', '$1᭄\u200Bᬧ᭄'],
			['(' + consonant_a + ')᭄\u25CCy', '$1᭄\u200Bᬬ᭄'],
			['(' + consonant_a + ')᭄\u25CCt', '$1᭄\u200Bᬢ᭄'],
			['(' + consonant_a + ')᭄\u25CCr', '$1᭄\u200Bᬭ᭄'],
			['(' + consonant_a + ')᭄\u25CCw', '$1᭄\u200Bᬯ᭄'],

			['(' + consonant_a + ')᭄\u25CC\\(', '$1᭄᭾'],
			['(' + consonant_a + ')᭄\u25CC\\*', '$1᭄᭛'],
			['(' + consonant_a + ')᭄\u25CC&', '$1᭄᭛'],
			['(' + consonant_a + ')᭄\u25CC\\^', '$1᭄᭛'],
			['(' + consonant_a + ')᭄\u25CC%', '$1᭄᭛'],
			['(' + consonant_a + ')᭄\u25CC\\$', '$1᭄꧍'],
			['(' + consonant_a + ')᭄\u25CC#', '$1᭄꧌'],
			['(' + consonant_a + ')᭄\u25CC@', '$1᭄᭚'],
			['(' + consonant_a + ')᭄\u25CC!', '$1᭄᭽'],

			['(' + consonant_a + ')᭄\u25CC/', '$1᭄'],
			['(' + consonant_a + ')᭄\u25CC.', '$1᭄᭟'],
			['(' + consonant_a + ')᭄\u25CC,', '$1᭄᭞'],
			
			// special case : cakra & pengkal
			['(' + consonant_a + '᭄)ᬭ᭄w', '$1᭄ᬭ᭄ᬬ᭄'],
			['(' + consonant_a + '᭄)ᬭ᭄y', '$1᭄ᬭ᭄ᬯ᭄'],

			// repha-dwita
			['ᬭ᭄k', 'ᬃᬓ᭄ᬓ᭄'],
			['ᬭ᭄K', 'ᬃᬓ᭄ᬔ᭄'],
			['ᬭ᭄g', 'ᬃᬕ᭄ᬕ᭄'],
			['ᬭ᭄G', 'ᬃᬕ᭄ᬖ᭄'],
			['ᬭ᭄x', 'ᬃᬗ᭄'],
			['ᬭ᭄c', 'ᬃᬘ᭄ᬘ᭄'],
			['ᬭ᭄C', 'ᬃᬘ᭄ᬙ᭄'],
			['ᬭ᭄j', 'ᬃᬚ᭄ᬚ᭄'],
			['ᬭ᭄J', 'ᬃᬚ᭄ᬛ᭄'],
			['ᬭ᭄z', 'ᬃᬜ᭄'],
			['ᬭ᭄f', 'ᬃᬝ᭄ᬝ᭄'],
			['ᬭ᭄F', 'ᬃᬝ᭄ᬞ᭄'],
			['ᬭ᭄v', 'ᬃᬤ᭄ᬟ᭄'],
			['ᬭ᭄V', 'ᬃᬤ᭄ᬠ᭄'],
			['ᬭ᭄N', 'ᬃᬡ᭄ᬦ᭄'],
			['ᬭ᭄t', 'ᬃᬢ᭄ᬢ᭄'],
			['ᬭ᭄T', 'ᬃᬣ᭄'],
			['ᬭ᭄d', 'ᬃᬤ᭄ᬤ᭄'],
			['ᬭ᭄D', 'ᬃᬤ᭄ᬥ᭄'],
			['ᬭ᭄n', 'ᬃᬡ᭄ᬦ᭄'],
			['ᬭ᭄p', 'ᬃᬧ᭄ᬧ᭄'],
			['ᬭ᭄P', 'ᬃᬧ᭄ᬨ᭄'],
			['ᬭ᭄b', 'ᬃᬩ᭄ᬩ᭄'],
			['ᬭ᭄B', 'ᬃᬩ᭄ᬪ᭄'],
			['ᬭ᭄m', 'ᬃᬫ᭄ᬫ᭄'],
			['ᬭ᭄y', 'ᬃᬬ᭄ᬬ᭄'],
			['ᬭ᭄r', 'ᬃᬭ᭄'],
			['ᬭ᭄l', 'ᬃᬮ᭄ᬮ᭄'],
			['ᬭ᭄w', 'ᬃᬯ᭄ᬯ᭄'],
			['ᬭ᭄s', 'ᬃᬱ᭄'],
			['ᬭ᭄S', 'ᬃᬱ᭄'],
			['ᬭ᭄h', 'ᬃᬳ᭄'],

			// wisarga shortcut
			['ᬓ᭄h', 'ᬔ᭄'],
			['ᬕ᭄h', 'ᬖ᭄'],
			['ᬘ᭄h', 'ᬙ᭄'],
			['ᬚ᭄h', 'ᬛ᭄'],
			['ᬱ᭄h', 'ᬰ᭄'],
			['ᬢ᭄h', 'ᬣ᭄'],
			['ᬝ᭄h', 'ᬞ᭄'],
			['ᬤ᭄h', 'ᬥ᭄'],
			['ᬟ᭄h', 'ᬠ᭄'],
			['ᬧ᭄h', 'ᬨ᭄'],
			['ᬩ᭄h', 'ᬪ᭄'],

			// don't let sa stacked
			['ᬲ᭄s', 'ᬲ᭄\u200Bᬲ᭄'],

			// 3-stack ha
			['ᬳ᭄(' + consonant_a + ')᭄k', 'ᬄ$1᭄ᬓ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄K', 'ᬄ$1᭄ᬔ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄g', 'ᬄ$1᭄ᬕ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄G', 'ᬄ$1᭄ᬖ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄x', 'ᬄ$1᭄ᬗ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄c', 'ᬄ$1᭄ᬘ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄C', 'ᬄ$1᭄ᬙ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄j', 'ᬄ$1᭄ᬚ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄J', 'ᬄ$1᭄ᬛ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄z', 'ᬄ$1᭄ᬜ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄f', 'ᬄ$1᭄ᬝ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄F', 'ᬄ$1᭄ᬞ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄v', 'ᬄ$1᭄ᬟ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄V', 'ᬄ$1᭄ᬠ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄N', 'ᬄ$1᭄ᬡ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄t', 'ᬄ$1᭄ᬢ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄T', 'ᬄ$1᭄ᬣ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄d', 'ᬄ$1᭄ᬤ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄D', 'ᬄ$1᭄ᬥ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄n', 'ᬄ$1᭄ᬦ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄p', 'ᬄ$1᭄ᬧ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄P', 'ᬄ$1᭄ᬨ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄b', 'ᬄ$1᭄ᬩ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄B', 'ᬄ$1᭄ᬪ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄m', 'ᬄ$1᭄ᬫ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄y', 'ᬄ$1᭄ᬬ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄l', 'ᬄ$1᭄ᬮ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄S', 'ᬄ$1᭄ᬱ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄s', 'ᬄ$1᭄ᬲ᭄'],
			['ᬳ᭄(' + consonant_a + ')᭄h', 'ᬄ$1᭄ᬳ᭄'],

			// 3-stack nga
			['ᬗ᭄(' + consonant_a + ')᭄k', 'ᬂ$1᭄ᬓ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄K', 'ᬂ$1᭄ᬔ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄g', 'ᬂ$1᭄ᬕ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄G', 'ᬂ$1᭄ᬖ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄x', 'ᬂ$1᭄ᬗ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄c', 'ᬂ$1᭄ᬘ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄C', 'ᬂ$1᭄ᬙ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄j', 'ᬂ$1᭄ᬚ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄J', 'ᬂ$1᭄ᬛ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄z', 'ᬂ$1᭄ᬜ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄f', 'ᬂ$1᭄ᬝ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄F', 'ᬂ$1᭄ᬞ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄v', 'ᬂ$1᭄ᬟ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄V', 'ᬂ$1᭄ᬠ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄n', 'ᬂ$1᭄ᬡ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄t', 'ᬂ$1᭄ᬢ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄T', 'ᬂ$1᭄ᬣ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄d', 'ᬂ$1᭄ᬤ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄D', 'ᬂ$1᭄ᬥ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄n', 'ᬂ$1᭄ᬦ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄p', 'ᬂ$1᭄ᬧ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄P', 'ᬂ$1᭄ᬨ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄b', 'ᬂ$1᭄ᬩ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄B', 'ᬂ$1᭄ᬪ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄m', 'ᬂ$1᭄ᬫ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄l', 'ᬂ$1᭄ᬮ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄S', 'ᬂ$1᭄ᬱ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄s', 'ᬂ$1᭄ᬲ᭄'],
			['ᬗ᭄(' + consonant_a + ')᭄h', 'ᬂ$1᭄ᬳ᭄'],

			// default 3-stack
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄k', '$1᭄\u200B$2᭄ᬓ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄K', '$1᭄\u200B$2᭄ᬔ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄g', '$1᭄\u200B$2᭄ᬕ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄G', '$1᭄\u200B$2᭄ᬖ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄x', '$1᭄\u200B$2᭄ᬗ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄c', '$1᭄\u200B$2᭄ᬘ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄C', '$1᭄\u200B$2᭄ᬙ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄j', '$1᭄\u200B$2᭄ᬚ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄J', '$1᭄\u200B$2᭄ᬛ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄z', '$1᭄\u200B$2᭄ᬜ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄f', '$1᭄\u200B$2᭄ᬝ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄F', '$1᭄\u200B$2᭄ᬞ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄v', '$1᭄\u200B$2᭄ᬟ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄V', '$1᭄\u200B$2᭄ᬠ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄N', '$1᭄\u200B$2᭄ᬡ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄t', '$1᭄\u200B$2᭄ᬢ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄T', '$1᭄\u200B$2᭄ᬣ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄d', '$1᭄\u200B$2᭄ᬤ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄D', '$1᭄\u200B$2᭄ᬥ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄n', '$1᭄\u200B$2᭄ᬦ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄p', '$1᭄\u200B$2᭄ᬧ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄P', '$1᭄\u200B$2᭄ᬨ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄b', '$1᭄\u200B$2᭄ᬩ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄B', '$1᭄\u200B$2᭄ᬪ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄m', '$1᭄\u200B$2᭄ᬫ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄l', '$1᭄\u200B$2᭄ᬮ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄S', '$1᭄\u200B$2᭄ᬱ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄s', '$1᭄\u200B$2᭄ᬲ᭄'],
			['(' + consonant_a + ')᭄(' + non_3_stack + ')᭄h', '$1᭄\u200B$2᭄ᬳ᭄'],

			// return pasangan
			['(' + consonant_a + ')᭄k', '$1᭄ᬓ᭄'],
			['(' + consonant_a + ')᭄K', '$1᭄ᬔ᭄'],
			['(' + consonant_a + ')᭄g', '$1᭄ᬕ᭄'],
			['(' + consonant_a + ')᭄G', '$1᭄ᬖ᭄'],
			['(' + consonant_a + ')᭄x', '$1᭄ᬗ᭄'],
			['(' + consonant_a + ')᭄c', '$1᭄ᬘ᭄'],
			['(' + consonant_a + ')᭄C', '$1᭄ᬙ᭄'],
			['(' + consonant_a + ')᭄j', '$1᭄ᬚ᭄'],
			['(' + consonant_a + ')᭄J', '$1᭄ᬛ᭄'],
			['(' + consonant_a + ')᭄z', '$1᭄ᬜ᭄'],
			['(' + consonant_a + ')᭄f', '$1᭄ᬝ᭄'],
			['(' + consonant_a + ')᭄F', '$1᭄ᬞ᭄'],
			['(' + consonant_a + ')᭄v', '$1᭄ᬟ᭄'],
			['(' + consonant_a + ')᭄V', '$1᭄ᬠ᭄'],
			['(' + consonant_a + ')᭄N', '$1᭄ᬡ᭄'],
			['(' + consonant_a + ')᭄t', '$1᭄ᬢ᭄'],
			['(' + consonant_a + ')᭄T', '$1᭄ᬣ᭄'],
			['(' + consonant_a + ')᭄d', '$1᭄ᬤ᭄'],
			['(' + consonant_a + ')᭄D', '$1᭄ᬥ᭄'],
			['(' + consonant_a + ')᭄n', '$1᭄ᬦ᭄'],
			['(' + consonant_a + ')᭄p', '$1᭄ᬧ᭄'],
			['(' + consonant_a + ')᭄P', '$1᭄ᬨ᭄'],
			['(' + consonant_a + ')᭄b', '$1᭄ᬩ᭄'],
			['(' + consonant_a + ')᭄B', '$1᭄ᬪ᭄'],
			['(' + consonant_a + ')᭄m', '$1᭄ᬫ᭄'],
			['(' + consonant_a + ')᭄y', '$1᭄ᬬ᭄'],
			['(' + consonant_a + ')᭄r', '$1᭄ᬭ᭄'],
			['(' + consonant_a + ')᭄l', '$1᭄ᬮ᭄'],
			['(' + consonant_a + ')᭄w', '$1᭄ᬯ᭄'],
			['(' + consonant_a + ')᭄S', '$1᭄ᬱ᭄'],
			['(' + consonant_a + ')᭄s', '$1᭄ᬲ᭄'],
			['(' + consonant_a + ')᭄h', '$1᭄ᬳ᭄'],

			// special case : cakra & pengkal
			['(' + consonant_a + ')᭄r', '$1᭄ᬭ᭄'],
			['(' + consonant_a + ')᭄y', '$1᭄ᬬ᭄'],

			// special case: rwa-rya
			['ᬃᬯ᭄ᬯ᭄ ', 'ᬭ᭄ᬯ᭄'],
			['ᬃᬬ᭄ᬬ᭄ ', 'ᬭ᭄ᬬ᭄'],
			['ᬭ᭄ᬬ᭄ ', 'ᬬ᭄ᬬᬃ᭄'],

			// dwita-wisarga shortcut
			['ᬃᬓ᭄ᬓ᭄h', 'ᬃᬓ᭄ᬔ᭄'],
			['ᬃᬕ᭄ᬕ᭄h', 'ᬃᬕ᭄ᬖ᭄'],
			['ᬃᬘ᭄ᬘ᭄h', 'ᬃᬘ᭄ᬙ᭄'],
			['ᬃᬚ᭄ᬚ᭄h', 'ᬃᬚ᭄ᬛ᭄'],
			['ᬃᬝ᭄ᬝ᭄h', 'ᬃᬝ᭄ᬞ᭄'],
			['ᬃᬤ᭄ᬟ᭄h', 'ᬃᬤ᭄ᬠ᭄'],
			['ᬃᬤ᭄ᬤ᭄h', 'ᬃᬤ᭄ᬥ᭄'],
			['ᬃᬧ᭄ᬧ᭄h', 'ᬃᬧ᭄ᬨ᭄'],
			['ᬃᬩ᭄ᬩ᭄h', 'ᬃᬩ᭄ᬪ᭄'],
			['ᬃᬱ᭄h', 'ᬃᬰ᭄'],
			['ᬃᬢ᭄ᬢ᭄h', 'ᬃᬣ᭄'],

			// repha fixup
			['ᬃᬡ᭄ᬦ᭄ ', 'ᬃᬡ᭄ᬡ᭄'],
			['ᬃᬯ᭄ ', 'ᬭ᭄ᬯ᭄'],
			['ᬃᬬ᭄ ', 'ᬭ᭄ᬬ᭄'],
			['ᬃᬮ᭄ᬮ᭄q', 'ᬃᬍ'],

			// single vocal
			['a', '', 'ᬵ'],                 // a
			['i', '', 'ᬶ'],                // i
			['u', '', 'ᬸ'],                // u
			['e', '', 'ᬾ'],                // é/è (taling)
			['o', '', 'ᭀ'],               // o (taling tarung)
			['q', '', 'ᬳᭂ'],                // ê 

			// consonant
			['b', '', 'ᬩ᭄'],
			['c', '', 'ᬘ᭄'],
			['d', '', 'ᬤ᭄'],
			['f', '', 'ᬝ᭄'],                // f untuk tha
			['g', '', 'ᬕ᭄'],
			['h', '', 'ᬳ᭄'],
			['j', '', 'ᬚ᭄'],
			['k', '', 'ᬓ᭄'],
			['l', '', 'ᬮ᭄'],
			['m', '', 'ᬫ᭄'],
			['n', '', 'ᬦ᭄'],
			['p', '', 'ᬧ᭄'],
			['r', '', 'ᬭ᭄'],
			['s', '', 'ᬲ᭄'],
			['t', '', 'ᬢ᭄'],
			['v', '', 'ᬟ᭄'],                // v untuk dha
			['w', '', 'ᬯ᭄'],
			['x', '', 'ᬗ᭄'],                // x untuk nga mati (sesuai Keyman)
			['y', '', 'ᬬ᭄'],
			['z', '', 'ᬜ᭄'],                // z untuk nya mati

			// shift series
			['A', '', 'ᬅ'],
			['B', '', 'ᬪ᭄'],
			['C', '', 'ᬙ᭄'],
			['D', '', 'ᬥ᭄'],
			['E', '', 'ᬏ'],
			['F', '', 'ᬞ᭄'],               // F untuk tha murda
			['G', '', 'ᬖ᭄'],
			['H', '', 'ᬄ'],                 // wignyan (h di akhir)
			['I', '', 'ᬇ'],
			['J', '', 'ᬛ᭄'],
			['K', '', 'ᬔ᭄'],
			['L', '', '᭄ᬮ᭄'],               // L untuk la mati (dengan pangkon di depan)
			['M', '', 'ᬁ'],                 // panyangga
			['N', '', 'ᬡ᭄'],
			['O', '', 'ᬑ'],
			['P', '', 'ᬨ᭄'],
			['Q', '', 'ᬅᭂ'],                // Q untuk pepet kapital
			['R', '', 'ᬃ'],                 // layar (r di akhir)
			['S', '', 'ᬱ᭄'],               // sa mahaprana
			['T', '', 'ᬣ᭄'],
			['U', '', 'ᬉ'],
			['V', '', 'ᬠ᭄'],               // V untuk dha murda
			['W', '', 'ᬯ᭄'],
			['X', '', 'ᬂ'],                 // X untuk cecak (seperti 'ng' kapital)
			['Y', '', 'ᬬ᭄'],
			['Z', '', 'ᬚ᭄ᬜ᭄'],             // Z untuk jnya

			// number
			['0', '', '᭐'],
			['1', '', '᭑'],
			['2', '', '᭒'],
			['3', '', '᭓'],
			['4', '', '᭔'],
			['5', '', '᭕'],
			['6', '', '᭖'],
			['7', '', '᭗'],
			['8', '', '᭘'],
			['9', '', '᭙'],

			// punctuation
			['\\?', '', '? '],              // tanda tanya (dengan spasi di belakang)
			[':', '', '᭝'],                 // colon menjadi tanda pangkat
			[';', '', '᭝'],                 // (alternatif)
			['\\.', '', '᭟'],               // titik
			[',', '', '᭞'],                 // koma
			['/', '', '᭄'],                 // slash menjadi pangkon
			['\\\\', '', '᭄'],              // backslash juga pangkon

			['\\*', '', 'ᭆ᭄'],               // bintang untuk pada madya
			['&', '', 'ᭊ᭄'],                 // ampersand untuk pada andhap
			['\\^', '', 'ᭉ᭄'],               // caret untuk rerenggan tengen
			['%', '', 'ᭈ᭄'],                 // persen untuk rerenggan kiwa
			['\\$', '', '᭽'],               // dollar untuk tutup kurung aksara
			['#', '', '᭚'],                 // hash untuk buka kurung aksara
			['@', '', '᭾'],                 // at untuk pada guru
			['!', '', '᭛'],                 // seru untuk pada pangkat
			['\\(', '', 'ᭋ᭄'],               // kurung buka untuk pada luhur
			['\\)', '', '᬴'],               // kurung tutup untuk cecak telu
		]
	};

	$.ime.register(banmanuscript);
}(jQuery));