(function ($) {
	'use strict';
	const consonant_a = '[𑼒𑼓𑼔𑼕𑼖𑼗𑼘𑼙𑼚𑼛𑼜𑼝𑼞𑼟𑼠𑼡𑼢𑼣𑼤𑼥𑼦𑼧𑼨𑼩𑼪𑼫𑼬𑼭𑼮𑼱𑼯𑼰𑼲]';
	const all_aksara = '[𑼄𑼆𑼐𑼎𑼈𑼉𑼏𑼇𑼊𑼌𑼍𑼒𑼓𑼔𑼕𑼖𑼗𑼘𑼙𑼚𑼛𑼜𑼝𑼞𑼟𑼠𑼡𑼢𑼣𑼤𑼥𑼦𑼧𑼨𑼩𑼪𑼫𑼬𑼭𑼮𑼱𑼯𑼰𑼲𑼴ꦵ𑼶𑼷𑼸𑼹𑼾𑼿𑽀꦳]';
	const symbol = '[𑽄𑽃𑽇𑽌𑽍𑽎𑽏𑽅𑽆𑽉𑽊𑽋‍ ]';
	const non_3_stack = '[𑼒𑼓𑼔𑼕𑼖𑼗𑼘𑼙𑼚𑼛𑼜𑼝𑼞𑼟𑼠𑼡𑼢𑼣𑼤𑼥𑼨𑼩𑼪𑼭𑼮𑼯]';


	var kawmanuscipt = {
		id: 'kaw-manuscript',
		name: 'Kawi',
		description: 'Kawi Manuscript',
		date: '2026-06-15',
		URL: '',
		author: 'Gesha Mahendra',
		license: 'GPLv3',
		version: '1',
		contextLength: 10,
		maxKeyLength: 10,

		patterns: [
			// Escape backslash (dari ULS asli, tetap dipertahankan)
			['\\\\([A-Za-z\\>_~\\.0-9])', '\\\\', '$1'],
			
			// long tarung fixup
			['𑼖a', '𑼖𑼵'],
			['𑼖𑽁o' , '𑼖𑼾𑼵'],
			
			['𑼜a' , '𑼜𑼵'],
			['𑼜𑽁o' , '𑼜𑼾𑼵'],
			
			['𑼨a' , '𑼨𑼵'],
			['𑼨𑽁o' , '𑼨𑼾𑼵'],
			
			['𑼦a' , '𑼦𑼵'],
			['𑼦𑽁o' , '𑼦𑼾𑼵'],
			
			['𑼭a' , '𑼭𑼵'],
			['𑼭𑽁o' , '𑼭𑼾𑼵'],

			// sigeg
			['(' + all_aksara + ')𑼖𑽁 ', '$1𑼁'],
			['(' + all_aksara + ')𑼲𑽁 ', '$1𑼃'],
			['(' + all_aksara + ')𑼬𑽁 ', '$1𑼂'],

			// sigeg fixup
			['𑼂𑼠𑽂𑼥𑽁y', '𑼂𑼥𑽂𑼫𑽁'],
			['𑼲𑽂𑼥𑽁y', '𑼃𑼥𑽂𑼫𑽁'],
			['𑼖𑽂𑼥𑽁y', '𑼁𑼥𑽂𑼫𑽁'],

			// sigeg swara
			['𑼖𑽁A', '𑼁𑼄'],
			['𑼖𑽁I', '𑼁𑼆'],
			['𑼖𑽁U', '𑼁𑼈'],
			['𑼖𑽁O', '𑼁𑼐'],
			['𑼖𑽁E', '𑼁𑼎'],
			['𑼖𑽁Q', '𑼁𑼄𑽀'],

			['𑼲𑽁A', '𑼃𑼄'],
			['𑼲𑽁I', '𑼃𑼆'],
			['𑼲𑽁U', '𑼃𑼈'],
			['𑼲𑽁O', '𑼃𑼐'],
			['𑼲𑽁E', '𑼃𑼎'],
			['𑼲𑽁Q', '𑼃𑼄𑽀'],

			['𑼬𑽁A', '𑼂𑼄'],
			['𑼬𑽁I', '𑼂𑼆'],
			['𑼬𑽁U', '𑼂𑼈'],
			['𑼬𑽁O', '𑼂𑼐'],
			['𑼬𑽁E', '𑼂𑼎'],
			['𑼬𑽁Q', '𑼂𑼄𑽀'],

			// sigeg symbol case
			['𑼖𑽁!', '𑼁𑽄'],
			['𑼖𑽁@', '𑼁𑽃'],
			['𑼖𑽁#', '𑼁𑽇'],
			['𑼖𑽁\\$', '𑼁𑽌'],
			['𑼖𑽁𑽁%', '𑼁𑽍'],
			['𑼖𑽁\\^', '𑼁𑽎'],
			['𑼖𑽁&', '𑼁𑽏'],
			['𑼖𑽁\\*', '𑼁𑽅'],
			['𑼖𑽁\\(', '𑼁𑽆'],
			['𑼖𑽁[:;]', '𑼁𑽋'],
			['𑼖𑽁1', '𑼁𑽋𑽑'],
			['𑼖𑽁2', '𑼁𑽋𑽒'],
			['𑼖𑽁3', '𑼁𑽋𑽓'],
			['𑼖𑽁4', '𑼁𑽋𑽔'],
			['𑼖𑽁5', '𑼁𑽋𑽕'],
			['𑼖𑽁6', '𑼁𑽋𑽖'],
			['𑼖𑽁7', '𑼁𑽋𑽗'],
			['𑼖𑽁8', '𑼁𑽋𑽘'],
			['𑼖𑽁9', '𑼁𑽋𑽙'],
			['𑼖𑽁0', '𑼁𑽋𑽐'],

			['𑼖𑽁,', '𑼁𑽉'],
			['𑼖𑽁\\.', '𑼁𑽊'],
			['𑼖𑽁\\?', '𑼁? '],

			['𑼲𑽁!', '𑼃𑽄'],
			['𑼲𑽁@', '𑼃𑽃'],
			['𑼲𑽁#', '𑼃𑽇'],
			['𑼲𑽁\\$', '𑼃𑽌'],
			['𑼲𑽁%', '𑼃𑽍'],
			['𑼲𑽁\\^', '𑼃𑽎'],
			['𑼲𑽁&', '𑼃𑽏'],
			['𑼲𑽁\\*', '𑼃𑽅'],
			['𑼲𑽁\\(', '𑼃𑽆'],
			['𑼲𑽁[:;]', '𑼃𑽋'],
			['𑼲𑽁1', '𑼃𑽋𑽑'],
			['𑼲𑽁2', '𑼃𑽋𑽒'],
			['𑼲𑽁3', '𑼃𑽋𑽓'],
			['𑼲𑽁4', '𑼃𑽋𑽔'],
			['𑼲𑽁5', '𑼃𑽋𑽕'],
			['𑼲𑽁6', '𑼃𑽋𑽖'],
			['𑼲𑽁7', '𑼃𑽋𑽗'],
			['𑼲𑽁8', '𑼃𑽋𑽘'],
			['𑼲𑽁9', '𑼃𑽋𑽙'],
			['𑼲𑽁0', '𑼃𑽋𑽐'],

			['𑼲𑽁,', '𑼃𑽉'],
			['𑼲𑽁\\.', '𑼃𑽊'],
			['𑼲𑽁\\?', '𑼃? '],

			['(' + consonant_a + ')𑼂!', '$1𑼬𑽁𑽄'],
			['(' + consonant_a + ')𑼂@', '$1𑼬𑽁𑽃'],
			['(' + consonant_a + ')𑼂#', '$1𑼬𑽁𑽇'],
			['(' + consonant_a + ')𑼂\\$', '$1𑼬𑽁𑽌'],
			['(' + consonant_a + ')𑼂%', '$1𑼬𑽁𑽍'],
			['(' + consonant_a + ')𑼂\\^', '$1𑼬𑽁𑽎'],
			['(' + consonant_a + ')𑼂&', '$1𑼬𑽁𑽏'],
			['(' + consonant_a + ')𑼂\\*', '$1𑼬𑽁𑽅'],
			['(' + consonant_a + ')𑼂\\(', '$1𑼬𑽁𑽆'],
			['(' + consonant_a + ')𑼂[:;]', '$1𑼬𑽁𑽋'],
			['(' + consonant_a + ')𑼂1', '$1𑼬𑽁𑽋𑽑'],
			['(' + consonant_a + ')𑼂2', '$1𑼬𑽁𑽋𑽒'],
			['(' + consonant_a + ')𑼂3', '$1𑼬𑽁𑽋𑽓'],
			['(' + consonant_a + ')𑼂4', '$1𑼬𑽁𑽋𑽔'],
			['(' + consonant_a + ')𑼂5', '$1𑼬𑽁𑽋𑽕'],
			['(' + consonant_a + ')𑼂6', '$1𑼬𑽁𑽋𑽖'],
			['(' + consonant_a + ')𑼂7', '$1𑼬𑽁𑽋𑽗'],
			['(' + consonant_a + ')𑼂8', '$1𑼬𑽁𑽋𑽘'],
			['(' + consonant_a + ')𑼂9', '$1𑼬𑽁𑽋𑽙'],
			['(' + consonant_a + ')𑼂0', '$1𑼬𑽁𑽋𑽐'],

			['(' + consonant_a + ')𑼂,', '$1𑼬𑽁𑽉'],
			['(' + consonant_a + ')𑼂\\.', '$1𑼬𑽁𑽊'],
			['(' + consonant_a + ')𑼂\\?', '$1𑼬𑽁? '],

			// null shortcut
			['^', 'a', '$1𑼲'],
			['^', 'i', '$1𑼲𑼶'],
			['^', 'u', '$1𑼲𑼸'],
			['^', 'q', '$1𑼲𑽀'],
			['^', 'e', '$1𑼲𑼾'],
			['^', 'o', '$1𑼲𑼾𑼴'],

			// symbol shortcut
			['(' + symbol + ')a', '$1𑼲'],
			['(' + symbol + ')i', '$1𑼲𑼶'],
			['(' + symbol + ')u', '$1𑼲𑼸'],
			['(' + symbol + ')q', '$1𑼲𑽀'],
			['(' + symbol + ')e', '$1𑼲𑼾'],
			['(' + symbol + ')o', '$1𑼲𑼾𑼴'],

			// zwsp vowel shotrcut
			['(' + consonant_a + ')𑽁\u25CCa', '$1𑽂𑼲'],
			['(' + consonant_a + ')𑽁\u25CCi', '$1𑽂𑼲𑼶'],
			['(' + consonant_a + ')𑽁\u25CCu', '$1𑽂𑼲𑼸'],
			['(' + consonant_a + ')𑽁\u25CCq', '$1𑽂𑼲𑽀'],
			['(' + consonant_a + ')𑽁\u25CCe', '$1𑽂𑼲𑼾'],
			['(' + consonant_a + ')𑽁\u25CCo', '$1𑽂𑼲𑼾𑼴'],

			['(' + consonant_a + ')𑽁\u25CCA', '$1𑽁\u200B𑼄'],
			['(' + consonant_a + ')𑽁\u25CCI', '$1𑽁\u200B𑼆'],
			['(' + consonant_a + ')𑽁\u25CCU', '$1𑽁\u200B𑼈'],
			['(' + consonant_a + ')𑽁\u25CCQ', '$1𑽁\u200B𑼄𑽀'],
			['(' + consonant_a + ')𑽁\u25CCE', '$1𑽁\u200B𑼎'],
			['(' + consonant_a + ')𑽁\u25CCO', '$1𑽁\u200B𑼐'],

			// force swara always above
			['(' + consonant_a + ')𑽁A', '$1𑽁\u200B𑼄'],
			['(' + consonant_a + ')𑽁I', '$1𑽁\u200B𑼆'],
			['(' + consonant_a + ')𑽁U', '$1𑽁\u200B𑼈'],
			['(' + consonant_a + ')𑽁Q', '$1𑽁\u200B𑼄𑽀'],
			['(' + consonant_a + ')𑽁E', '$1𑽁\u200B𑼎'],
			['(' + consonant_a + ')𑽁O', '$1𑽁\u200B𑼐'],

			// la pepet & pa cerek variant
			['(' + consonant_a + ')𑽂𑼭𑽁q', '$1𑽂𑼭𑽀'],
			['(' + consonant_a + ')𑽂𑼭𑽀 ', '$1𑽁\u200B𑼌'],

			['(' + consonant_a + ')𑽁\u25CC𑼬𑽁q', '$1𑽂𑼊'],
			['(' + consonant_a + ')𑽂𑼬𑽁q', '$1𑼺'],

			['𑼭𑽁q', '𑼌'],
			['𑼬𑽁q', '𑼊'],

			// swara elongation
			['𑼄[aA]', '𑼅'],
			['𑼆[iIa]', '𑼇'],
			['𑼈[uU]', '𑼉'],
			['𑼄𑽀[qQ]', '𑼄𑽀𑼴'],
			['𑼎[eE]', '𑼏'],
			['𑼐[oO]', '𑼐𑼴'],

			// special swara
			['𑼊[aiueqo]', '𑼊'],
			['𑼌[aiueqo]', '𑼌'],
			['𑼺[aiueqo]', '𑼺'],

			// return sandhangan
			['(' + consonant_a + ')𑽁a', '$1'],
			['(' + consonant_a + ')𑽁i', '$1𑼶'],
			['(' + consonant_a + ')𑽁u', '$1𑼸'],
			['(' + consonant_a + ')𑽁e', '$1𑼾'],
			['(' + consonant_a + ')𑽁q', '$1𑽀'],
			['(' + consonant_a + ')𑽁o', '$1𑼾𑼴'],

			['(' + consonant_a + ')𑽁\\)', '$1꦳'],
			['(' + consonant_a + ')𑽁M', '$1𑼀'],
			['(' + consonant_a + ')𑽁 ', '$1𑽁\u25CC'],

			// special cecak telu
			['(' + consonant_a + ')꦳𑽁a', '$1꦳'],
			['(' + consonant_a + ')꦳𑽁i', '$1꦳𑼶'],
			['(' + consonant_a + ')꦳𑽁u', '$1꦳𑼸'],
			['(' + consonant_a + ')꦳𑽁e', '$1꦳𑼾'],
			['(' + consonant_a + ')꦳𑽁q', '$1꦳𑽀'],
			['(' + consonant_a + ')꦳𑽁o', '$1꦳𑼾𑼴'],

			['(' + consonant_a + ')꦳i', '$1꦳𑼿'],
			['(' + consonant_a + ')꦳u', '$1꦳𑼿𑼴'],

			// sandhangan fixup 
			['(' + consonant_a + ')i', '$1𑼿'],
			['(' + consonant_a + ')u', '$1𑼿𑼴'],

			['(' + consonant_a + ')q', '$1𑼲𑽀'],
			['(' + consonant_a + ')e', '$1𑼲𑼾'],
			['(' + consonant_a + ')o', '$1𑼲𑼾𑼴'],

			// sigeg-vocal fixup 

			['(𑼂)A', '$1𑼲'],
			['(𑼂)i', '$1𑼲𑼶'],
			['(𑼂)u', '$1𑼲𑼸'],
			['(𑼂)q', '$1𑼲𑽀'],
			['(𑼂)e', '$1𑼲𑼾'],
			['(𑼂)o', '$1𑼲𑼾𑼴'],

			['(𑼁)a', '$1𑼲'],
			['(𑼁)i', '$1𑼲𑼶'],
			['(𑼁)u', '$1𑼲𑼸'],
			['(𑼁)q', '$1𑼲𑽀'],
			['(𑼁)e', '$1𑼲𑼾'],
			['(𑼁)o', '$1𑼲𑼾𑼴'],

			['(𑼃)a', '$1𑼲'],
			['(𑼃)i', '$1𑼲𑼶'],
			['(𑼃)u', '$1𑼲𑼸'],
			['(𑼃)q', '$1𑼲𑽀'],
			['(𑼃)e', '$1𑼲𑼾'],
			['(𑼃)o', '$1𑼲𑼾𑼴'],

			// swara-vocal fixup 

			['(𑼄)i', '$1𑼲𑼶'],
			['(𑼄)u', '$1𑼲𑼸'],
			['(𑼄)q', '$1𑼲𑽀'],
			['(𑼄)e', '$1𑼲𑼾'],
			['(𑼄)o', '$1𑼲𑼾𑼴'],

			['(𑼅)i', '$1𑼲𑼶'],
			['(𑼅)u', '$1𑼲𑼸'],
			['(𑼅)q', '$1𑼲𑽀'],
			['(𑼅)e', '$1𑼲𑼾'],
			['(𑼅)o', '$1𑼲𑼾𑼴'],

			['(𑼆)u', '$1𑼲𑼸'],
			['(𑼆)q', '$1𑼲𑽀'],
			['(𑼆)e', '$1𑼲𑼾'],
			['(𑼆)o', '$1𑼲𑼾𑼴'],

			['(𑼇)a', '$1𑼲'],
			['(𑼇)u', '$1𑼲𑼸'],
			['(𑼇)q', '$1𑼲𑽀'],
			['(𑼇)e', '$1𑼲𑼾'],
			['(𑼇)o', '$1𑼲𑼾𑼴'],

			['(𑼈)a', '$1𑼲'],
			['(𑼈)i', '$1𑼲𑼶'],
			['(𑼈)q', '$1𑼲𑽀'],
			['(𑼈)e', '$1𑼲𑼾'],
			['(𑼈)o', '$1𑼲𑼾𑼴'],

			['(𑼉)a', '$1𑼲'],
			['(𑼉)i', '$1𑼲𑼶'],
			['(𑼉)q', '$1𑼲𑽀'],
			['(𑼉)e', '$1𑼲𑼾'],
			['(𑼉)o', '$1𑼲𑼾𑼴'],

			['(𑼎)a', '$1𑼲'],
			['(𑼎)i', '$1𑼲𑼶'],
			['(𑼎)u', '$1𑼲𑼸'],
			['(𑼎)q', '$1𑼲𑽀'],
			['(𑼎)o', '$1𑼲𑼾𑼴'],

			['(𑼏)a', '$1𑼲'],
			['(𑼏)i', '$1𑼲𑼶'],
			['(𑼏)u', '$1𑼲𑼸'],
			['(𑼏)q', '$1𑼲𑽀'],
			['(𑼏)e', '$1𑼲𑼾'],
			['(𑼏)o', '$1𑼲𑼾𑼴'],

			['(𑼄𑽀)a', '$1𑼲'],
			['(𑼄𑽀)i', '$1𑼲𑼶'],
			['(𑼄𑽀)u', '$1𑼲𑼸'],
			['(𑼄𑽀)e', '$1𑼲𑼾'],
			['(𑼄𑽀)o', '$1𑼲𑼾𑼴'],

			['(𑼄𑽀𑼴)a', '$1𑼲'],
			['(𑼄𑽀𑼴)i', '$1𑼲𑼶'],
			['(𑼄𑽀𑼴)u', '$1𑼲𑼸'],
			['(𑼄𑽀𑼴)e', '$1𑼲𑼾'],
			['(𑼄𑽀𑼴)o', '$1𑼲𑼾𑼴'],

			['(𑼐)a', '$1𑼲'],
			['(𑼐)i', '$1𑼲𑼶'],
			['(𑼐)q', '$1𑼲𑽀'],
			['(𑼐)e', '$1𑼲𑼾'],

			['(𑼐𑼴)a', '$1𑼲'],
			['(𑼐𑼴)i', '$1𑼲𑼶'],
			['(𑼐𑼴)u', '$1𑼲𑼸'],
			['(𑼐𑼴)q', '$1𑼲𑽀'],
			['(𑼐𑼴)e', '$1𑼲𑼾'],
			['(𑼐𑼴)o', '$1𑼲𑼾𑼴'],

			// sandangan-vocal meetup
			['(' + consonant_a + ')𑼶q', '$1𑽂𑼫𑽀'],
			['(' + consonant_a + ')𑼶e', '$1𑽂𑼫𑼾'],
			['(' + consonant_a + ')𑼶o', '$1𑽂𑼫𑼾𑼴'],

			['(' + consonant_a + ')𑼷q', '$1𑽂𑼫𑽀'],
			['(' + consonant_a + ')𑼷e', '$1𑽂𑼫𑼾'],
			['(' + consonant_a + ')𑼷o', '$1𑽂𑼫𑼾𑼴'],

			['(' + consonant_a + ')𑼸q', '$1𑽂𑼮𑽀'],
			['(' + consonant_a + ')𑼸e', '$1𑽂𑼮𑼾'],
			['(' + consonant_a + ')𑼸o', '$1𑽂𑼮𑼾𑼴'],

			['(' + consonant_a + ')𑼹q', '$1𑽂𑼮𑽀'],
			['(' + consonant_a + ')𑼹e', '$1𑽂𑼮𑼾'],
			['(' + consonant_a + ')𑼹o', '$1𑽂𑼮𑼾𑼴'],

			['(𑼴)i', '$1𑼲𑼶'],
			['(𑼴)u', '$1𑼲𑼸'],
			['(𑼴)q', '$1𑼲𑽀'],
			['(𑼴)e', '$1𑼲𑼾'],
			['(𑼴)o', '$1𑼲𑼾𑼴'],

			['(𑼾)a', '$1𑼫'],
			['(𑼾)i', '$1𑼫𑼶'],
			['(𑼾)u', '$1𑼫𑼸'],
			['(𑼾)q', '$1𑼫𑽀'],
			['(𑼾)o', '$1𑼫𑼾𑼴'],

			['(𑽀)a', '$1𑼲'],
			['(𑽀)i', '$1𑼲𑼶'],
			['(𑽀)u', '$1𑼲𑼸'],
			['(𑽀)e', '$1𑼲𑼾'],
			['(𑽀)o', '$1𑼲𑼾𑼴'],

			['(𑽀𑼴)a', '$1𑼲'],
			['(𑽀𑼴)i', '$1𑼲𑼶'],
			['(𑽀𑼴)u', '$1𑼲𑼸'],
			['(𑽀𑼴)e', '$1𑼲𑼾'],
			['(𑽀𑼴)o', '$1𑼲𑼾𑼴'],

			['(𑼾𑼴)a', '$1𑼮'],
			['(𑼾𑼴)i', '$1𑼮𑼶'],
			['(𑼾𑼴)u', '$1𑼮𑼸'],
			['(𑼾𑼴)q', '$1𑼮𑽀'],
			['(𑼾𑼴)e', '$1𑼮𑼾'],

			// change panglancar h
			['𑽂𑼲 ', '𑽁\u200B𑼄'],
			['𑽂𑼲𑼴 ', '𑽁\u200B𑼅'],
			['𑽂𑼲𑼶 ', '𑽁\u200B𑼆'],
			['𑽂𑼲𑼷 ', '𑽁\u200B𑼇'],
			['𑽂𑼲𑼸 ', '𑽁\u200B𑼈'],
			['𑽂𑼲𑼹 ', '𑽁\u200B𑼉'],
			['𑽂𑼲𑽀 ', '𑽁\u200B𑼄𑽀'],
			['𑽂𑼲𑽀𑼴 ', '𑽁\u200B𑼄𑽀𑼴'],
			['𑽂𑼲𑼾 ', '𑽁\u200B𑼎'],
			['𑽂𑼲𑼾𑼴 ', '𑽁\u200B𑼐'],
			['𑽂𑼲𑼿 ', '𑽁\u200B𑼏'],
			['𑽂𑼲𑼿𑼴 ', '𑽁\u200B𑼐𑼴'],

			['𑼲 ', '𑼄'],
			['𑼲𑼴 ', '𑼅'],
			['𑼲𑼶 ', '𑼆'],
			['𑼲𑼷 ', '𑼇'],
			['𑼲𑼸 ', '𑼈'],
			['𑼲𑼹 ', '𑼉'],
			['𑼲𑽀 ', '𑼄𑽀'],
			['𑼲𑽀𑼴 ', '𑼄𑽀𑼴'],
			['𑼲𑼾 ', '𑼎'],
			['𑼲𑼾𑼴 ', '𑼐'],
			['𑼲𑼿 ', '𑼏'],
			['𑼲𑼿𑼴 ', '𑼐𑼴'],

			// redo panglancar h
			['𑽁\u200B𑼄 ', '𑽂𑼲'],
			['𑽁\u200B𑼅 ', '𑽂𑼲𑼴'],
			['𑽁\u200B𑼆 ', '𑽂𑼲𑼶'],
			['𑽁\u200B𑼇 ', '𑽂𑼲𑼷'],
			['𑽁\u200B𑼈 ', '𑽂𑼲𑼸'],
			['𑽁\u200B𑼉 ', '𑽂𑼲𑼹'],
			['𑽁\u200B𑼄𑽀 ', '𑽂𑼲𑽀'],
			['𑽁\u200B𑼄𑽀𑼴 ', '𑽂𑼲𑽀𑼴'],
			['𑽁\u200B𑼎 ', '𑽂𑼲𑼾'],
			['𑽁\u200B𑼐 ', '𑽂𑼲𑼾𑼴'],
			['𑽁\u200B𑼏 ', '𑽂𑼲𑼿'],
			['𑽁\u200B𑼐𑼴 ', '𑽂𑼲𑼿𑼴'],

			['𑼄 ', '𑼲'],
			['𑼅 ', '𑼲𑼴'],
			['𑼆 ', '𑼲𑼶'],
			['𑼇 ', '𑼲𑼷'],
			['𑼈 ', '𑼲𑼸'],
			['𑼉 ', '𑼲𑼹'],
			['𑼄𑽀 ', '𑼲𑽀'],
			['𑼄𑽀𑼴 ', '𑼲𑽀𑼴'],
			['𑼎 ', '𑼲𑼾'],
			['𑼐 ', '𑼲𑼾𑼴'],
			['𑼏 ', '𑼲𑼿'],
			['𑼐𑼴 ', '𑼲𑼿𑼴'],

			// sandhangan modification
			['𑼴a', '𑼴'],

			['𑼶i', '𑼷'],
			['𑼷i', '𑼷'],

			['𑼸u', '𑼹'],
			['𑼹u', '𑼹'],

			['𑼾e', '𑼿'],
			['𑼿e', '𑼿'],

			['𑼾𑼴o', '𑼿𑼴'],
			['𑼿𑼴o', '𑼿𑼴'],

			['꦳\\)', '꦳'],
			['𑼀M', '𑼀'],

			['𑽀q', '𑽀𑼴'],
			['𑽀𑼴q', '𑽀𑼴'],

			['𑼶a', '𑽂𑼫'],
			['𑼶u', '𑽂𑼫𑼸'],
			['𑼸a', '𑽂𑼮'],
			['𑼸i', '𑽂𑼮𑼶'],

			// contextual dictionary
			['𑼥𑽁c', '𑼛𑽂𑼗𑽁'],
			['𑼥𑽁C', '𑼛𑽂𑼘𑽁'],
			['𑼥𑽁j', '𑼛𑽂𑼙𑽁'],
			['𑼥𑽁J', '𑼛𑽂𑼚𑽁'],
			['𑼥𑽁f', '𑼠𑽂𑼜𑽁'],
			['𑼥𑽁F', '𑼠𑽂𑼝𑽁'],
			['𑼥𑽁v', '𑼠𑽂𑼞𑽁'],
			['𑼥𑽁V', '𑼠𑽂𑼟𑽁'],

			['𑼠𑽁D', '𑼥𑽂𑼤𑽁'],
			['𑼠𑽂𑼣𑽁h', '𑼥𑽂𑼤𑽁'],

			['𑼱𑽁f', '𑼰𑽂𑼜𑽁'],
			['𑼱𑽁F', '𑼰𑽂𑼝𑽁'],

			['𑼒𑽁s', '𑼒𑽂𑼰𑽁'],
			['𑼔𑽁s', '𑼔𑽂𑼰𑽁'],

			['𑼒𑽂𑼱𑽁m', '𑼒𑽂𑼰𑽂𑼪𑽁'],

			['𑼒𑽁\u25CCs', '𑼒𑽂𑼱𑽁'],
			['𑼔𑽁\u25CCs', '𑼔𑽂𑼱𑽁'],

			['𑼒𑼺𑼱𑽁n', '𑼒𑼺𑼰𑽂𑼠𑽁'],

			['𑼮𑼶𑼱𑽁n', '𑼮𑼶𑼰𑽂𑼠𑽁'],

			['𑼮𑼶𑼰𑽂𑼠𑽁 ', '𑼮𑼶𑼱𑽂𑼥𑽁'],
			['𑼙𑽂𑼛𑽁 ', '𑼳𑽁'],

			['𑼱𑽁c', '𑼯𑽂𑼗𑽁'],
			['𑼱𑽁C', '𑼯𑽂𑼘𑽁'],
			['𑼱𑽁j', '𑼯𑽂𑼙𑽁'],
			['𑼱𑽁J', '𑼯𑽂𑼚𑽁'],

			['𑼯𑽂𑼗𑽁 ', '𑼱𑽂𑼗𑽁'],
			['𑼯𑽂𑼘𑽁 ', '𑼱𑽂𑼘𑽁'],
			['𑼯𑽂𑼙𑽁 ', '𑼱𑽂𑼙𑽁'],
			['𑼯𑽂𑼚𑽁 ', '𑼱𑽂𑼚𑽁'],

			['𑼺𑼱𑽁n', '𑼺𑼰𑽂𑼠𑽁'],
			['𑼺𑼱𑽁t', '𑼺𑼰𑽂𑼜𑽁'],
			['𑼺𑼣𑽁d', '𑼺𑼣𑽂𑼤𑽁'],

			['𑼦𑼸𑼱𑽁p', '𑼦𑼸𑼰𑽂𑼦𑽁'],
			['𑼦𑼸𑼰𑽂𑼦𑽁u', '𑼦𑼸𑼱𑽂𑼦𑼸'],

			// pasangan-\u25CC separation
			['(' + consonant_a + ')𑽁\u25CC\\?', '$1𑽂? '],
			['(' + consonant_a + ')𑽁\u25CC/', '$1𑽁𑽋'],
			['(' + consonant_a + ')𑽁\u25CCN', '$1𑽁\u200B𑼠𑽁'],
			['(' + consonant_a + ')𑽁\u25CCB', '$1𑽁\u200B𑼩𑽁'],
			['(' + consonant_a + ')𑽁\u25CCV', '$1𑽁\u200B𑼟𑽁'],
			['(' + consonant_a + ')𑽁\u25CCC', '$1𑽁\u200B𑼘𑽁'],
			['(' + consonant_a + ')𑽁\u25CCZ', '$1𑽁\u200B𑼙𑽂𑼛𑽁'],
			['(' + consonant_a + ')𑽁\u25CCL', '$1𑽁\u200B𑽂𑼭𑽁'],
			['(' + consonant_a + ')𑽁\u25CCK', '$1𑽁\u200B𑼓𑽁'],
			['(' + consonant_a + ')𑽁\u25CCJ', '$1𑽁\u200B𑼚𑽁'],
			['(' + consonant_a + ')𑽁\u25CCH', '$1𑽁\u200B𑼃'],
			['(' + consonant_a + ')𑽁\u25CCG', '$1𑽁\u200B𑼕𑽁'],
			['(' + consonant_a + ')𑽁\u25CCF', '$1𑽁\u200B𑼝𑽁'],
			['(' + consonant_a + ')𑽁\u25CCD', '$1𑽁\u200B𑼤𑽁'],
			['(' + consonant_a + ')𑽁\u25CCS', '$1𑽁\u200B𑼰𑽁'],
			['(' + consonant_a + ')𑽁\u25CCP', '$1𑽁\u200B𑼧𑽁'],
			['(' + consonant_a + ')𑽁\u25CCT', '$1𑽁\u200B𑼢𑽁'],

			['(' + consonant_a + ')𑽁\u25CCm', '$1𑽁\u200B𑼪𑽁'],
			['(' + consonant_a + ')𑽁\u25CCn', '$1𑽁\u200B𑼥𑽁'],
			['(' + consonant_a + ')𑽁\u25CCb', '$1𑽁\u200B𑼨𑽁'],
			['(' + consonant_a + ')𑽁\u25CCv', '$1𑽁\u200B𑼞𑽁'],
			['(' + consonant_a + ')𑽁\u25CCc', '$1𑽁\u200B𑼗𑽁'],
			['(' + consonant_a + ')𑽁\u25CCx', '$1𑽁\u200B𑼖𑽁'],
			['(' + consonant_a + ')𑽁\u25CCz', '$1𑽁\u200B𑼛𑽁'],
			['(' + consonant_a + ')𑽁\u25CCl', '$1𑽁\u200B𑼭𑽁'],
			['(' + consonant_a + ')𑽁\u25CCk', '$1𑽁\u200B𑼒𑽁'],
			['(' + consonant_a + ')𑽁\u25CCj', '$1𑽁\u200B𑼙𑽁'],
			['(' + consonant_a + ')𑽁\u25CCh', '$1𑽁\u200B𑼲𑽁'],
			['(' + consonant_a + ')𑽁\u25CCg', '$1𑽁\u200B𑼔𑽁'],
			['(' + consonant_a + ')𑽁\u25CCf', '$1𑽁\u200B𑼜𑽁'],
			['(' + consonant_a + ')𑽁\u25CCd', '$1𑽁\u200B𑼣𑽁'],
			['(' + consonant_a + ')𑽁\u25CCs', '$1𑽁\u200B𑼱𑽁'],
			['(' + consonant_a + ')𑽁\u25CCp', '$1𑽁\u200B𑼦𑽁'],
			['(' + consonant_a + ')𑽁\u25CCy', '$1𑽁\u200B𑼫𑽁'],
			['(' + consonant_a + ')𑽁\u25CCt', '$1𑽁\u200B𑼡𑽁'],
			['(' + consonant_a + ')𑽁\u25CCr', '$1𑽁\u200B𑼬𑽁'],
			['(' + consonant_a + ')𑽁\u25CCw', '$1𑽁\u200B𑼮𑽁'],

			['(' + consonant_a + ')𑽁\u25CC\\(', '$1𑽁𑽆'],
			['(' + consonant_a + ')𑽁\u25CC\\*', '$1𑽁𑽅'],
			['(' + consonant_a + ')𑽁\u25CC&', '$1𑽁𑽍'],
			['(' + consonant_a + ')𑽁\u25CC\\^', '$1𑽁𑽇'],
			['(' + consonant_a + ')𑽁\u25CC%', '$1𑽁𑽇'],
			['(' + consonant_a + ')𑽁\u25CC\\$', '$1𑽂꧍'],
			['(' + consonant_a + ')𑽁\u25CC#', '$1𑽂꧌'],
			['(' + consonant_a + ')𑽁\u25CC@', '$1𑽁𑽃'],
			['(' + consonant_a + ')𑽁\u25CC!', '$1𑽁𑽄'],

			['(' + consonant_a + ')𑽁\u25CC/', '$1𑽁'],
			['(' + consonant_a + ')𑽁\u25CC.', '$1𑽁𑽊'],
			['(' + consonant_a + ')𑽁\u25CC,', '$1𑽁𑽉'],

			// special case : cakra & pengkal
			['(' + consonant_a + ')𑽂𑼬𑽁w', '$1𑽂𑼬𑽂𑼮𑽁'],
			['(' + consonant_a + ')𑽂𑼬𑽁y', '$1𑽂𑼬𑽂𑼫𑽁'],

			// repha-dwita
			['𑼬𑽁k', '𑼂𑼒𑽂𑼒𑽁'],
			['𑼬𑽁K', '𑼂𑼒𑽂𑼓𑽁'],
			['𑼬𑽁g', '𑼂𑼔𑽂𑼔𑽁'],
			['𑼬𑽁G', '𑼂𑼔𑽂𑼕𑽁'],
			['𑼬𑽁x', '𑼂𑼖𑽁'],
			['𑼬𑽁c', '𑼂𑼗𑽂𑼗𑽁'],
			['𑼬𑽁C', '𑼂𑼗𑽂𑼘𑽁'],
			['𑼬𑽁j', '𑼂𑼙𑽂𑼙𑽁'],
			['𑼬𑽁J', '𑼂𑼙𑽂𑼚𑽁'],
			['𑼬𑽁z', '𑼂𑼛𑽁'],
			['𑼬𑽁f', '𑼂𑼜𑽂𑼜𑽁'],
			['𑼬𑽁F', '𑼂𑼜𑽂𑼝𑽁'],
			['𑼬𑽁v', '𑼂𑼣𑽂𑼞𑽁'],
			['𑼬𑽁V', '𑼂𑼣𑽂𑼟𑽁'],
			['𑼬𑽁N', '𑼂𑼠𑽂𑼥𑽁'],
			['𑼬𑽁t', '𑼂𑼡𑽂𑼡𑽁'],
			['𑼬𑽁T', '𑼂𑼢𑽁'],
			['𑼬𑽁d', '𑼂𑼣𑽂𑼣𑽁'],
			['𑼬𑽁D', '𑼂𑼣𑽂𑼤𑽁'],
			['𑼬𑽁n', '𑼂𑼠𑽂𑼥𑽁'],
			['𑼬𑽁p', '𑼂𑼦𑽂𑼦𑽁'],
			['𑼬𑽁P', '𑼂𑼦𑽂𑼧𑽁'],
			['𑼬𑽁b', '𑼂𑼨𑽂𑼨𑽁'],
			['𑼬𑽁B', '𑼂𑼨𑽂𑼩𑽁'],
			['𑼬𑽁m', '𑼂𑼪𑽂𑼪𑽁'],
			['𑼬𑽁y', '𑼂𑼫𑽂𑼫𑽁'],
			['𑼬𑽁r', '𑼂𑼬𑽁'],
			['𑼬𑽁l', '𑼂𑼭𑽂𑼭𑽁'],
			['𑼬𑽁w', '𑼂𑼮𑽂𑼮𑽁'],
			['𑼬𑽁s', '𑼂𑼰𑽁'],
			['𑼬𑽁S', '𑼂𑼰𑽁'],
			['𑼬𑽁h', '𑼂𑼲𑽁'],

			// wisarga shortcut
			['𑼒𑽁h', '𑼓𑽁'],
			['𑼔𑽁h', '𑼕𑽁'],
			['𑼗𑽁h', '𑼘𑽁'],
			['𑼙𑽁h', '𑼚𑽁'],
			['𑼰𑽁h', '𑼯𑽁'],
			['𑼡𑽁h', '𑼢𑽁'],
			['𑼜𑽁h', '𑼝𑽁'],
			['𑼣𑽁h', '𑼤𑽁'],
			['𑼞𑽁h', '𑼟𑽁'],
			['𑼦𑽁h', '𑼧𑽁'],
			['𑼨𑽁h', '𑼩𑽁'],

			// don't let sa stacked
			['𑼱𑽁s', '𑼱𑽁\u200B𑼱𑽁'],

			// 3-stack ha
			['𑼲𑽂(' + consonant_a + ')𑽁k', '𑼃$1𑽂𑼒𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁K', '𑼃$1𑽂𑼓𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁g', '𑼃$1𑽂𑼔𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁G', '𑼃$1𑽂𑼕𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁x', '𑼃$1𑽂𑼖𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁c', '𑼃$1𑽂𑼗𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁C', '𑼃$1𑽂𑼘𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁j', '𑼃$1𑽂𑼙𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁J', '𑼃$1𑽂𑼚𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁z', '𑼃$1𑽂𑼛𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁f', '𑼃$1𑽂𑼜𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁F', '𑼃$1𑽂𑼝𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁v', '𑼃$1𑽂𑼞𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁V', '𑼃$1𑽂𑼟𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁N', '𑼃$1𑽂𑼠𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁t', '𑼃$1𑽂𑼡𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁T', '𑼃$1𑽂𑼢𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁d', '𑼃$1𑽂𑼣𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁D', '𑼃$1𑽂𑼤𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁n', '𑼃$1𑽂𑼥𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁p', '𑼃$1𑽂𑼦𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁P', '𑼃$1𑽂𑼧𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁b', '𑼃$1𑽂𑼨𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁B', '𑼃$1𑽂𑼩𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁m', '𑼃$1𑽂𑼪𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁y', '𑼃$1𑽂𑼫𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁l', '𑼃$1𑽂𑼭𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁S', '𑼃$1𑽂𑼰𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁s', '𑼃$1𑽂𑼱𑽁'],
			['𑼲𑽂(' + consonant_a + ')𑽁h', '𑼃$1𑽂𑼲𑽁'],

			// 3-stack nga
			['𑼖𑽂(' + consonant_a + ')𑽁k', '𑼁$1𑽂𑼒𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁K', '𑼁$1𑽂𑼓𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁g', '𑼁$1𑽂𑼔𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁G', '𑼁$1𑽂𑼕𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁x', '𑼁$1𑽂𑼖𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁c', '𑼁$1𑽂𑼗𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁C', '𑼁$1𑽂𑼘𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁j', '𑼁$1𑽂𑼙𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁J', '𑼁$1𑽂𑼚𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁z', '𑼁$1𑽂𑼛𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁f', '𑼁$1𑽂𑼜𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁F', '𑼁$1𑽂𑼝𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁v', '𑼁$1𑽂𑼞𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁V', '𑼁$1𑽂𑼟𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁n', '𑼁$1𑽂𑼠𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁t', '𑼁$1𑽂𑼡𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁T', '𑼁$1𑽂𑼢𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁d', '𑼁$1𑽂𑼣𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁D', '𑼁$1𑽂𑼤𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁n', '𑼁$1𑽂𑼥𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁p', '𑼁$1𑽂𑼦𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁P', '𑼁$1𑽂𑼧𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁b', '𑼁$1𑽂𑼨𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁B', '𑼁$1𑽂𑼩𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁m', '𑼁$1𑽂𑼪𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁l', '𑼁$1𑽂𑼭𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁S', '𑼁$1𑽂𑼰𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁s', '𑼁$1𑽂𑼱𑽁'],
			['𑼖𑽂(' + consonant_a + ')𑽁h', '𑼁$1𑽂𑼲𑽁'],

			// default 3-stack
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁k', '$1𑽁\u200B$2𑽂𑼒𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁K', '$1𑽁\u200B$2𑽂𑼓𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁g', '$1𑽁\u200B$2𑽂𑼔𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁G', '$1𑽁\u200B$2𑽂𑼕𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁x', '$1𑽁\u200B$2𑽂𑼖𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁c', '$1𑽁\u200B$2𑽂𑼗𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁C', '$1𑽁\u200B$2𑽂𑼘𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁j', '$1𑽁\u200B$2𑽂𑼙𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁J', '$1𑽁\u200B$2𑽂𑼚𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁z', '$1𑽁\u200B$2𑽂𑼛𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁f', '$1𑽁\u200B$2𑽂𑼜𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁F', '$1𑽁\u200B$2𑽂𑼝𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁v', '$1𑽁\u200B$2𑽂𑼞𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁V', '$1𑽁\u200B$2𑽂𑼟𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁N', '$1𑽁\u200B$2𑽂𑼠𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁t', '$1𑽁\u200B$2𑽂𑼡𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁T', '$1𑽁\u200B$2𑽂𑼢𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁d', '$1𑽁\u200B$2𑽂𑼣𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁D', '$1𑽁\u200B$2𑽂𑼤𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁n', '$1𑽁\u200B$2𑽂𑼥𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁p', '$1𑽁\u200B$2𑽂𑼦𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁P', '$1𑽁\u200B$2𑽂𑼧𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁b', '$1𑽁\u200B$2𑽂𑼨𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁B', '$1𑽁\u200B$2𑽂𑼩𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁m', '$1𑽁\u200B$2𑽂𑼪𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁l', '$1𑽁\u200B$2𑽂𑼭𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁S', '$1𑽁\u200B$2𑽂𑼰𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁s', '$1𑽁\u200B$2𑽂𑼱𑽁'],
			['(' + consonant_a + ')𑽂(' + non_3_stack + ')𑽁h', '$1𑽁\u200B$2𑽂𑼲𑽁'],

			// return pasangan
			['(' + consonant_a + ')𑽁k', '$1𑽂𑼒𑽁'],
			['(' + consonant_a + ')𑽁K', '$1𑽂𑼓𑽁'],
			['(' + consonant_a + ')𑽁g', '$1𑽂𑼔𑽁'],
			['(' + consonant_a + ')𑽁G', '$1𑽂𑼕𑽁'],
			['(' + consonant_a + ')𑽁x', '$1𑽂𑼖𑽁'],
			['(' + consonant_a + ')𑽁c', '$1𑽂𑼗𑽁'],
			['(' + consonant_a + ')𑽁C', '$1𑽂𑼘𑽁'],
			['(' + consonant_a + ')𑽁j', '$1𑽂𑼙𑽁'],
			['(' + consonant_a + ')𑽁J', '$1𑽂𑼚𑽁'],
			['(' + consonant_a + ')𑽁z', '$1𑽂𑼛𑽁'],
			['(' + consonant_a + ')𑽁f', '$1𑽂𑼜𑽁'],
			['(' + consonant_a + ')𑽁F', '$1𑽂𑼝𑽁'],
			['(' + consonant_a + ')𑽁v', '$1𑽂𑼞𑽁'],
			['(' + consonant_a + ')𑽁V', '$1𑽂𑼟𑽁'],
			['(' + consonant_a + ')𑽁N', '$1𑽂𑼠𑽁'],
			['(' + consonant_a + ')𑽁t', '$1𑽂𑼡𑽁'],
			['(' + consonant_a + ')𑽁T', '$1𑽂𑼢𑽁'],
			['(' + consonant_a + ')𑽁d', '$1𑽂𑼣𑽁'],
			['(' + consonant_a + ')𑽁D', '$1𑽂𑼤𑽁'],
			['(' + consonant_a + ')𑽁n', '$1𑽂𑼥𑽁'],
			['(' + consonant_a + ')𑽁p', '$1𑽂𑼦𑽁'],
			['(' + consonant_a + ')𑽁P', '$1𑽂𑼧𑽁'],
			['(' + consonant_a + ')𑽁b', '$1𑽂𑼨𑽁'],
			['(' + consonant_a + ')𑽁B', '$1𑽂𑼩𑽁'],
			['(' + consonant_a + ')𑽁m', '$1𑽂𑼪𑽁'],
			['(' + consonant_a + ')𑽁y', '$1𑽂𑼫𑽁'],
			['(' + consonant_a + ')𑽁r', '$1𑽂𑼬𑽁'],
			['(' + consonant_a + ')𑽁l', '$1𑽂𑼭𑽁'],
			['(' + consonant_a + ')𑽁w', '$1𑽂𑼮𑽁'],
			['(' + consonant_a + ')𑽁S', '$1𑽂𑼰𑽁'],
			['(' + consonant_a + ')𑽁s', '$1𑽂𑼱𑽁'],
			['(' + consonant_a + ')𑽁h', '$1𑽂𑼲𑽁'],

			// special case: rwa-rya
			['𑼂𑼮𑽂𑼮𑽁 ', '𑼬𑽂𑼮𑽁'],
			['𑼂𑼫𑽂𑼫𑽁 ', '𑼬𑽂𑼫𑽁'],
			['𑼬𑽂𑼫𑽁 ', '𑼂𑼫𑽂𑼫𑽁'],

			// dwita-wisarga shortcut
			['𑼂𑼒𑽂𑼒𑽁h', '𑼂𑼒𑽂𑼓𑽁'],
			['𑼂𑼔𑽂𑼔𑽁h', '𑼂𑼔𑽂𑼕𑽁'],
			['𑼂𑼗𑽂𑼗𑽁h', '𑼂𑼗𑽂𑼘𑽁'],
			['𑼂𑼙𑽂𑼙𑽁h', '𑼂𑼙𑽂𑼚𑽁'],
			['𑼂𑼜𑽂𑼜𑽁h', '𑼂𑼜𑽂𑼝𑽁'],
			['𑼂𑼣𑽂𑼞𑽁h', '𑼂𑼣𑽂𑼟𑽁'],
			['𑼂𑼣𑽂𑼣𑽁h', '𑼂𑼣𑽂𑼤𑽁'],
			['𑼂𑼦𑽂𑼦𑽁h', '𑼂𑼦𑽂𑼧𑽁'],
			['𑼂𑼨𑽂𑼨𑽁h', '𑼂𑼨𑽂𑼩𑽁'],
			['𑼂𑼰𑽁h', '𑼂𑼯𑽁'],
			['𑼂𑼡𑽂𑼡𑽁h', '𑼂𑼢𑽁'],

			// repha fixup
			['𑼂𑼠𑽂𑼥𑽁 ', '𑼂𑼠𑽂𑼠𑽁'],
			['𑼂𑼮𑽁 ', '𑼬𑽂𑼮𑽁'],
			['𑼂𑼫𑽁 ', '𑼬𑽂𑼫𑽁'],
			['𑼂𑼭𑽂𑼭𑽁q', '𑼂𑼌'],

			// single vocal
			['a', '', '𑼴'],                 // a
			['i', '', '𑼶'],                // i
			['u', '', '𑼸'],                // u
			['e', '', '𑼾'],                // é/è (taling)
			['o', '', '𑼾𑼴'],               // o (taling tarung)
			['q', '', '𑼲𑽀'],                // ê 

			// consonant
			['b', '', '𑼨𑽁'],
			['c', '', '𑼗𑽁'],
			['d', '', '𑼣𑽁'],
			['f', '', '𑼜𑽁'],                // f untuk tha
			['g', '', '𑼔𑽁'],
			['h', '', '𑼲𑽁'],
			['j', '', '𑼙𑽁'],
			['k', '', '𑼒𑽁'],
			['l', '', '𑼭𑽁'],
			['m', '', '𑼪𑽁'],
			['n', '', '𑼥𑽁'],
			['p', '', '𑼦𑽁'],
			['r', '', '𑼬𑽁'],
			['s', '', '𑼱𑽁'],
			['t', '', '𑼡𑽁'],
			['v', '', '𑼞𑽁'],                // v untuk dha
			['w', '', '𑼮𑽁'],
			['x', '', '𑼖𑽁'],                // x untuk nga mati (sesuai Keyman)
			['y', '', '𑼫𑽁'],
			['z', '', '𑼛𑽁'],                // z untuk nya mati

			// shift series
			['A', '', '𑼄'],
			['B', '', '𑼩𑽁'],
			['C', '', '𑼘𑽁'],
			['D', '', '𑼤𑽁'],
			['E', '', '𑼎'],
			['F', '', '𑼝𑽁'],               // F untuk tha murda
			['G', '', '𑼕𑽁'],
			['H', '', '𑼃'],                 // wignyan (h di akhir)
			['I', '', '𑼆'],
			['J', '', '𑼚𑽁'],
			['K', '', '𑼓𑽁'],
			['L', '', '𑽂𑼭𑽁'],               // L untuk la mati (dengan pangkon di depan)
			['M', '', '𑼀'],                 // panyangga
			['N', '', '𑼠𑽁'],
			['O', '', '𑼐'],
			['P', '', '𑼧𑽁'],
			['Q', '', '𑼄𑽀'],                // Q untuk pepet kapital
			['R', '', '𑼂'],                 // layar (r di akhir)
			['S', '', '𑼰𑽁'],               // sa mahaprana
			['T', '', '𑼢𑽁'],
			['U', '', '𑼈'],
			['V', '', '𑼟𑽁'],               // V untuk dha murda
			['W', '', '𑼮𑽁'],
			['X', '', '𑼁'],                 // X untuk cecak (seperti 'ng' kapital)
			['Y', '', '𑼫𑽁'],
			['Z', '', '𑼙𑽂𑼛𑽁'],             // Z untuk jnya

			// number
			['0', '', '𑽐'],
			['1', '', '𑽑'],
			['2', '', '𑽒'],
			['3', '', '𑽓'],
			['4', '', '𑽔'],
			['5', '', '𑽕'],
			['6', '', '𑽖'],
			['7', '', '𑽗'],
			['8', '', '𑽘'],
			['9', '', '𑽙'],

			// punctuation
			['\\?', '', '? '],              // tanda tanya (dengan spasi di belakang)
			[':', '', '𑽋'],                 // colon menjadi tanda pangkat
			[';', '', '𑽋'],                 // (alternatif)
			['\\.', '', '𑽊'],               // titik
			[',', '', '𑽉'],                 // koma
			['/', '', ' 𑽂 '],                 // slash menjadi pangkon
			['\\\\', '', '𑽁'],              // backslash juga pangkon

			['\\*', '', '𑽅'],               
			['&', '', '𑽏'],                 
			['\\^', '', '𑽎'],               
			['%', '', '𑽍'],                 
			['\\$', '', '𑽌'],               
			['#', '', '𑽇'],              
			['@', '', '𑽃'],             
			['!', '', '𑽄'],          
			['\\(', '', '𑽆'],          
			['\\)', '', '꦳'],          
		]
	};

	$.ime.register(kawmanuscipt);
}(jQuery));