( function ( $ ) {
	'use strict';

	var orLekhani = {
		id: 'or-lekhani',
		name: 'ଫୋନେଟିକ',
		description: 'Odia Lekhani phonetic input method',
		date: '2012-10-14',
		URL: 'http://github.com/wikimedia/jquery.ime',
		author: 'Junaid P V and Subhashish Panigrahi',
		license: 'GPLv3',
		version: '1.0',
		contextLength: 4,
		maxKeyLength: 2,
		patterns: [
			['\\\\([A-Za-z\\>_~\\.0-9])', '\\\\', '$1'],

			// vowel (swarabarna/swaravarna)
			['ଅa', 'ଆ'], //aa
			['ଏe', 'ଐ'], //ai
			['ଅu', 'ଔ'], //au
			['ଋR', 'ୠ'], // RR
			['\u200c?a', 'ଅ'], //a
			['\u200c?e', 'ଏ'],  //e
			['\u200c?i', 'ଇ'], //i
		        ['\u200c?o', 'ଓ'], //o
			['\u200c?u', 'ଉ'], //u		        
			['\u200c?A', 'ଆ'], //aa
			['\u200c?E', 'ଐ'], //ai
			['\u200c?I', 'ଈ'], //I (dirgha)
			['\u200c?O', 'ଔ'], //au
			['\u200c?U', 'ଊ'], //U (dirgha)
			['M', 'ଂ'], //anuswara
			['X', 'ଁ'], //chandrabindu
			['ଂM', 'ଁ'], // chandrabindu
			['H', 'ଃ'],  //bisarga (visarga)
			['z', '୍'], // halanta
			['\\.', '।'], //purnacheda
			[ '_', '\u200c' ], //zero width non joiner
			
			//consonents (byanjana barna/vyanjana)
			['b', 'ବ'], // ba
			['c', '', 'ଚ'], //ca
			['d', 'ଦ'], //da
			['g', 'ଗ'],  //ga
			['G', 'ଘ'],  //gha
			['h', 'ହ'], //ha
			['j', 'ଜ'], //ja
			['k', 'କ'], //ka
			['କh', 'ଖ'], // kh
			['ଗh', 'ଘ'], // gh
			['l', 'ଲ'], //la
			['m', 'ମ'], //ma
			['n', 'ନ'], //na
			['p', 'ପ'], //pa
			['q', 'ଡ଼'], //Da
			['r', 'ର'], //ra
			['s', 'ସ'], //sa
			['t', 'ତ'], //ta
			['[vwVW]', 'ୱ'], //wa
			['x', 'କ୍ଷ'], //xa
			['[Y]', 'ୟ'], //ya
			['[y]', 'ଯ'], //ja (antastha)
			['B', 'ବ'], //ba
			['C', 'ଛ'], //cha
			['D', 'ଡ'], //Da
			['F', 'ଫ'], //pha
			['J', 'ଯ'], //ja (antastha)
			['K', 'ଖ'], //kha
			['L', 'ଳ'], //La
			['N', 'ଣ'], //Na
			['Q', 'ଢ଼'], //Dha (with bindu)
			['R', 'ଋ'], //Rr
			['S', 'ଶ'], //Sha (talabya/talavya)
			['ଟh', 'ଠ'], // Th
			['ଡh', 'ଢ'], // Dh
			['ତh', 'ଥ'], // th
			['ଦh', 'ଧ'], // dh
			['(f|ପh)', 'ଫ'], // ph or f
			['(ବh|B)', 'ଭ'], // bh
			['Sh', 'ଷ'], // sh
			['T', 'ଟ'], //Ta
			
			//matra and phala
			['([(କ-ହୟୱଡ଼ଢ଼ଙ୍କଙ୍ଖଙ୍ଗଙ୍ଘଞ୍ଚଞ୍ଛଞ୍ଝଣ୍ଟଣ୍ଠଣ୍ଡଣ୍ଢନ୍ତନ୍ଥନ୍ଦନ୍ଧମ୍ପମ୍ଫମ୍ବମ୍ଭଞ୍ଜ])a', '$1ା'],  //aa kara
			['([କ-ଳଲନ୍ଧଥଡ଼ଢ଼ହୟୱରକ୍ଷଶସଷଙ୍କଙ୍ଖଙ୍ଗଙ୍ଘଞ୍ଚଞ୍ଛଞ୍ଝଣ୍ଟଣ୍ଠଣ୍ଡଣ୍ଢନ୍ତନ୍ଥନ୍ଦନ୍ଧମ୍ପମ୍ଫମ୍ବମ୍ଭଞ୍ଜ])i', '$1\u0b3f'], // i kara
			['([କ-ହୟୱଡ଼ଢ଼ଙ୍କଙ୍ଖଙ୍ଗଙ୍ଘଞ୍ଚଞ୍ଛଞ୍ଝଣ୍ଟଣ୍ଠଣ୍ଡଣ୍ଢନ୍ତନ୍ଥନ୍ଦନ୍ଧମ୍ପମ୍ଫମ୍ବମ୍ଭଞ୍])I', '$1ୀ'], //I (dirgha) kara
			['([କ-ହୟୱଡ଼ଢ଼ଙ୍କଙ୍ଖଙ୍ଗଙ୍ଘଞ୍ଚଞ୍ଛଞ୍ଝଣ୍ଟଣ୍ଠଣ୍ଡଣ୍ଢନ୍ତନ୍ଥନ୍ଦନ୍ଧମ୍ପମ୍ଫମ୍ବମ୍ଭଞ୍])u', '$1\u0b41'], // u kara
			['([କ-ହୟୱ])(U|\u0b41u)', '$1\u0b42'],
			['([କ-ହୟୱ])R', '$1\u0b43'],  // R kara
			['([କ-ହୟୱ])\u0b43R', '$1\u0b44'],
			['([କ-ହୟୱ])୍ଳ୍l', '$1ୢ'],
			['([କ-ହୟୱ])ୢl', '$1ୣ'],
			['([କ-ହୟୱଡ଼ଢ଼ଙ୍କଙ୍ଖଙ୍ଗଙ୍ଘଞ୍ଚଞ୍ଛଞ୍ଝଣ୍ଟଣ୍ଠଣ୍ଡଣ୍ଢନ୍ତନ୍ଥନ୍ଦନ୍ଧମ୍ପମ୍ଫମ୍ବମ୍ଭଞ୍])e', '$1େ'], // e kara
			['([କ-ହୟୱଡ଼ଢ଼ଙ୍କଙ୍ଖଙ୍ଗଙ୍ଘଞ୍ଚଞ୍ଛଞ୍ଝଣ୍ଟଣ୍ଠଣ୍ଡଣ୍ଢନ୍ତନ୍ଥନ୍ଦନ୍ଧମ୍ପମ୍ଫମ୍ବମ୍ଭଞ୍])o', '$1ୋ'], // o kara
			['([କ-ହୟୱଡ଼ଢ଼ଙ୍କଙ୍ଖଙ୍ଗଙ୍ଘଞ୍ଚଞ୍ଛଞ୍ଝଣ୍ଟଣ୍ଠଣ୍ଡଣ୍ଢନ୍ତନ୍ଥନ୍ଦନ୍ଧମ୍ପମ୍ଫମ୍ବମ୍ଭଞ୍])(ାu|ୋu)', '$1ୌ'],
			['([କ-ହୟୱ])E', '$1\u0B48'],  //ai kara
			['([କ-ହୟୱ])(w|v)', '$1୍ୱ'], // ba phala
			['([କ-ହୟୱ])~', '$1\u200C'],
			['([କ-ହୟୱ])y', '$1୍ୟ'], // ya kara
			['ଆ\\\\', '\u0B3E'], // aa sign
			['ଇ\\\\', '\u0B3F'], // i sign
			['ଈ\\\\', '\u0B40'], // I sign
			['ଉ\\\\', '\u0B41'], // u sign
			['ଉ\\\\', '\u0B42'], // U sign
			['ଋ\\\\', '\u0B43'], // R sign
			['ୠ\\\\', '\u0B44'], // RR sign
			['ଌ\\\\', '\u0B62'], // L sign
			['ୡ\\\\', '\u0B63'], // LL sign
			['ଏ\\\\', '\u0B47'], // e sign
			['ଐ\\\\', '\u0B48'], // ai sign
			['ଓ\\\\', '\u0B4B'], // o sign
			['ଔ\\\\', '\u0B4C'], // au sign
			['//', '୍ର'], //ra kara
	
			
			//conjuncts (juktakhyara/yuktakshyara)
			// doubles
			['କk', 'କ୍କ'], // kk
			['ଗg', 'ଗ୍ଗ'], // gg
			['ଚc', 'ଚ୍ଚ'], // cc
			['ଜj', 'ଜ୍ଜ'], // jj
			['ଦd', 'ଦ୍ଦ'], // dd
			['ଟT', 'ଟ୍ଟ'], // TT
			['ଡD', 'ଡ୍ଡ'], // DD
			['ତt', 'ତ୍ତ'], // tt
			['ଲl', 'ଲ୍ଲ'], // ll
			['ପp', 'ପ୍ପ'], //pp
			//nasal
			['Z', 'ଜ୍ଞ'],//gya
			['ଞ୍ଚh', 'ଞ୍ଛ'], // nch
			['ଞ୍ଜh', 'ଞ୍ଝ'], // njh
			['ଙ୍କh', 'ଙ୍ଖ'], // nkh
			['ଙ୍ଗh', 'ଙ୍ଘ'], // ngh
			['ହm', 'ହ୍ମ'], // mh
			['ହn', 'ହ୍ନ'], // nh
			['ମ୍ବh', 'ମ୍ଭ'], // mbh or nbh
			['ଣ୍ଡai', 'ଣ୍ଡାଇ'], // NDai
			['ଜ୍ଜh', 'ଜ୍ଝ'], // jjh
			['ଚ୍ଚh', 'ଚ୍ଛ'], // cch
			['ଣG', 'ଙ'], // NG
			['ଣg', 'ଞ'], // Ng
			['ନc', 'ଞ୍ଚ'], // nc
			['ନg', 'ଙ୍ଗ'], // ng
			['ଚh', 'ଛ'], // ch
			['C', 'ଛ'], // ch
			['ଜh', 'ଝ'], // jh
			['ନj', 'ଞ୍ଜ'], // nj
			['ନk', 'ଙ୍କ'], // nk
			['ନd', 'ନ୍ଦ'], // nd
			['ଣD', 'ଣ୍ଡ'], // nd
			['ଣDh', 'ଣ୍ଢ'], //ndh
			['ନdh', 'ନ୍ଧ'], // ndht
			['ମb', 'ମ୍ବ'], // mb 
			['ଣT', 'ଣ୍ଟ'], // NT
			['ଣTh', 'ଣ୍ଠ'], // NTh
			['(ମ)p', 'ମ୍ପ'], //shp
			//others
			['ଷT', '$1୍ଟ'], // ST
			['Shp', 'ଷ୍ପ'], // sp

                                   // numericals

			['0', '୦'],
			['1', '୧'],
			['2', '୨'],
			['3', '୩'],
			['4', '୪'],
			['5', '୫'],
			['6', '୬'],
			['7', '୭'],
			['8', '୮'],
			['9', '୯']
		]
	};

	$.ime.register( orLekhani );
}( jQuery ) );
